[
  {
    "session_name": "Beyond One Database : A Practical Guide to PolyStorage Architectures",
    "description": "As enterprises scale and AI becomes ubiquitous, traditional single-model databases fall short. This session explores Poly Storage architectures—the intelligent integration of relational, document, graph, and vector databases to optimize modern data ecosystems. Attendees will learn to evaluate each model's strengths, design composable architectures for scalability and performance, and avoid common pitfalls. We'll also highlight real-world use cases like semantic search, personalization, and responsible data representation.",
    "speaker_name(s)": "Shoma Chakravarty, Lakshmi Sagari isukapally",
    "time": "Wednesday, November 05, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Beyond Statistical Significance: Designing Robust AB Tests",
    "description": "Learn how to design robust A/B tests that are both statistically sound and practically meaningful. Manisha Arora, Data Science Lead at Google and Banani Mohapatra, Data Science Manager at Walmart will talk about how to set a good hypothesis, select metrics that reflect long-term success, understand trade-offs, and interpret results. We will walk through real-world examples and case studies to show how to run smarter experiments that lead to better products.",
    "speaker_name(s)": "Manisha Arora, Banani Mohapatra",
    "time": "Wednesday, November 05, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Career Resilience: Thriving Through Change",
    "description": "The future won't wait, and neither should your career. This session is about building resilience in the face of change. Leaders will share how they've navigated disruption, embraced new technologies, and designed careers that endure. The focus is on practical inspiration: seeing change as opportunity, and shaping a career path that grows with you, no matter what the future brings.",
    "speaker_name(s)": "Diane Gonzalez, Mary Beth Westmoreland, Heather Peterson",
    "time": "Wednesday, November 05, 09:00 AM 09:45 AM",
    "type": "Sponsored Session",
    "category": "",
    "experience_level": ""
  },
  {
    "session_name": "Circle of Strength: How Female Friendships can Anchor Mental Health in Tech",
    "description": "A deeply personal session on facing burnout, imposter syndrome, and life upheavals while building a tech career-and how authentic female friendships became the lifeline. This talk explores the emotional side of success and the often-overlooked power of community care. In this heartfelt presentation, the speakers share their personal journey through the highs and lows of a career in tech-grappling with moments of self-doubt, burnout, career pivots, and family pressures. Rather than a linear success story, this session sheds light on the messy, human side of ambition. At the heart of this journey lies a quiet but powerful force: female friendship. The speakers will recount specific moments where peers, mentors, and sisterhood circles helped them find clarity, courage, and comfort-especially during periods of mental and emotional distress.",
    "speaker_name(s)": "Snehal Nahar, Neha Hemant Raut, Pavithra Kannan",
    "time": "Wednesday, November 05, 09:00 AM 10:00 AM",
    "type": "Workshop",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Comedy as a Catalyst",
    "description": "This interactive session explores how comedy can inspire agency, resilience, and connection in the face of serious problems such as the climate crisis. Learn how comedy is good for our brains, how to craft and share your own stories to engage diverse audiences, and how to use humor as a powerful, joyful tool for teaching and learning.",
    "speaker_name(s)": "Sophie Shrand",
    "time": "Wednesday, November 05, 09:00 AM 10:00 AM",
    "type": "Workshop",
    "category": "",
    "experience_level": ""
  },
  {
    "session_name": "Failing Forward: How an Internship Setback Launched My Career in Tech",
    "description": "When you see me today, you see a Customer Solutions Manager at one of the world's leading tech companies, managing over $1 billion in revenue. What you don't see is the early-career version of me—entering a tech internship with no guidance, no mentors, and ultimately, no return offer. It felt like a personal and professional failure—one that shook my confidence and made me question whether I belonged in tech at all. In this talk, I want to share the lessons I learned not after I succeeded, but when I was stumbling. I'll walk through the unspoken skills and strategies I wish someone had told me back then-from how to ask questions that show initiative, to how to use 1:1s to grow, and how to connect your work to real impact. My hope is to set the next generation of women in tech up for success—not by showing them how to be perfect, but how to be resilient, self-aware, and ready to lead, even when the plan falls apart.",
    "speaker_name(s)": "Shalaka Dhayatkar",
    "time": "Wednesday, November 05, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "From college to conference rooms: 5 must-do strategies to be limitless as a new grad",
    "description": "Starting your first job can feel daunting, but you're not alone! The transition from college to the corporate world can be overwhelming, and in this session, I'll share 5 actionable strategies to help you not only survive but thrive. My own journey began with a literal bang—I broke my foot on day one at work. As someone who was eager and ambitious, that setback was a major curveball. But despite the obstacles, I ended my first year at Microsoft by launching my first feature. I'll share how I turned setbacks into success, teaching you how to step out of your comfort zone, find allies, adapt to change, align with team priorities, and know and voice your interests. Through personal stories, interactive discussion, and practical takeaways, you'll leave with a ready-to-use \"Advice Wall\" to navigate corporate life with crowdsourced strategies to resolve your fears about starting your first year as a corporate employee. Let's make your first year not just successful—but transformational!",
    "speaker_name(s)": "Suvarna Saraswat",
    "time": "Wednesday, November 05, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "From Technical Expert to Strategic Leader: Navigating a 27+ Year Tech Career",
    "description": "Amanda's journey from technical specialist to strategic executive reveals how combining technical expertise with leadership skills creates paths to executive roles. Starting with a Computer Information Systems diploma, early focus on programming/coding and technical consulting built technical credibility. Her first leadership role at Pythian Group taught crucial lessons in balancing technical work with people management and client relationships. At AWS, Amanda's leadership expanded to directing 85 engineers, 6 managers, and managing a billion-dollar Healthcare & Life Sciences portfolio. This phase showed how technical knowledge drives business strategy and C-suite relationships. Her drive proves technical expertise paired with leadership skills creates career growth opportunities. For technical professionals seeking leadership roles, maintaining technical credibility while developing business acumen leads to impactful positions.",
    "speaker_name(s)": "Amanda MacDonald",
    "time": "Wednesday, November 05, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "How Data Scientist can leverage AI'eds superpower to deliver impact",
    "description": "Discover how integrating AI into your data science workflow dramatically increases productivity and speeds up time-to-value delivery. We will demo examples of using ChatGPT, GitHub Copilot/Cursor, and other AI tools to eliminate lengthy, repetitive tasks and streamline your daily workflow. The audience will walk away with practical knowledge on how to integrate AI into their daily workflow. We will also share tips to identify and avoid common pitfalls when using AI tools, ensuring reliable results while maximizing their benefits.",
    "speaker_name(s)": "Ruonan Hao, Stacy Li",
    "time": "Wednesday, November 05, 09:00 AM 10:00 AM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "How did you get that job? Strategies for a Successful Career Shift",
    "description": "",
    "speaker_name(s)": "Cristiane de Melo, Preethi Ravula, Sona Rajamani",
    "time": "Wednesday, November 05, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Impact Without Seniority: Building Credibility, Craft, and Community in Your First Two Years Without Managing People",
    "description": "Offer a framework to scale technical impact while staying close to code. Many technologists crave deeper impact but don't want to become people-managers. This talk unpacks a repeatable framework—\"Career Architecture\"—for scaling influence as a Staff, Principal, or Distinguished Engineer. We'll walk through a three-pillar model: Technical North Star '96 how to own a strategic architectural vision and keep it evergreen. Organizational API '96 concrete tactics for routing decisions, feedback, and conflict through you (not around you) without a formal team. Execution Flywheel '96 building momentum via proofs-of-concept, metrics dashboards, and \"decision engravings\" (RFCs, ADRs). Attendees leave with live templates (Markdown + Mermaid), a 90-day influence roadmap, and a playbook for mentoring without line authority. Whether you're eyeing Staff promotion or already wear the title but need sharper influence skills, you'll walk away ready to architect both systems and your career.",
    "speaker_name(s)": "Xinyi Lin",
    "time": "Wednesday, November 05, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Invisible Work, Visible Impact: Recognizing & Communicating Work That Doesn'edt Show Up on Dashboards",
    "description": "",
    "speaker_name(s)": "Neha Bassi",
    "time": "Wednesday, November 05, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Lead Where You Are: How Community Engagement Elevates Workplace Leadership",
    "description": "",
    "speaker_name(s)": "Apurva Bhagali",
    "time": "Wednesday, November 05, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Performance Like an Athlete: Balancing Health and Career for Long-Term Success",
    "description": "Just as athletes must balance intense training with recovery, data scientists and technologists must balance professional excellence with self-care. In this session, I'll share insights into how managing screen time, nurturing relationships, and connecting with nature can dramatically enhance professional performance, creativity, and sustainability in a high-stakes career.",
    "speaker_name(s)": "Anh Le",
    "time": "Wednesday, November 05, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Smarter, Not Hotter: Green Principles for AI Design",
    "description": "Every AI prompt has a hidden cost - measured not just in dollars, but also in kilowatt-hours. As generative AI becomes more embedded in our workflows, its environmental impact demands attention. This session is designed for product leaders, engineers, and tech advocates who want to build and use AI responsibly. Through real-world case studies, we will unpack the energy footprint of large language models and challenge common assumptions around their usage. Attendees will explore when simpler models outperform LLMs, and learn practical techniques like model pruning, quantization, and green infrastructure choices to reduce energy use. We will also outline how to optimize training and deployment pipelines, ask the right evaluation questions, and adopt a sustainability-first mindset. Attendees will leave with actionable strategies and a clear framework for creating smarter, more efficient, and environmentally responsible AI products.",
    "speaker_name(s)": "Swathi Adimulam",
    "time": "Wednesday, November 05, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Tech for Social Good: Using Technology to Drive Positive Cultural and Societal Impact",
    "description": "Tech for Social Good: Using Technology to Drive Positive Cultural and Societal Impact As technology continues to shape the world, its potential to drive social and cultural change is immense. Tech is no longer just a tool for business growth but a powerful instrument to solve complex global challenges like inequality, climate change, and access to education. This session will explore how technology can be used to create positive societal impact and foster cultural advancement, with a focus on how organizations, tech companies, and social initiatives are leveraging technology for good. By presenting real-world case studies, expert insights, and actionable strategies, attendees will understand how technology is addressing societal problems and how they can incorporate social responsibility into their own work. The session will focus on using technology to reduce inequality, combat climate change, and empower marginalized communities.",
    "speaker_name(s)": "Kavita Chhabria",
    "time": "Wednesday, November 05, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "The Door Opens for Everyone: How Inclusive Design Unlocks Product Innovation",
    "description": "Accessibility is often considered late in the product development cycle, leading to retrofits rather than inclusive innovations. This session advocates for an \"Accessibility-First\" approach—where designing for edge cases leads to experiences that benefit everyone. From curb cuts to motion-sensor doors, history shows that accessible design often drives mainstream convenience. Today, opening a door with just a wave of the hand serves not only wheelchair users but also parents juggling toddlers or travelers pulling suitcases. Drawing from my research published at ACM CHI 2024, I explore how neurodiverse young adults navigate online job and housing searches, uncovering systemic usability gaps in mainstream platforms. I'll discuss what it means to build products that accommodate cognitive and sensory differences—and how that unlocks better UX for all. Attendees will learn how accessibility-first thinking becomes a force multiplier for usability, customer reach, and product quality.",
    "speaker_name(s)": "Tanya Jha, Saloni Yadav, Linh Tong",
    "time": "Wednesday, November 05, 09:00 AM 10:00 AM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "The Engineering Collaboration Code: Navigating Stakeholders, Teams, and Partners for Project Success",
    "description": "Have you ever struggled to align with product managers? Been blocked waiting for other teams' code reviews? Had your design challenged after implementation was already underway? As software engineers, we've all felt the fatigue that comes from poor collaboration. In this session, we'll explore real-life case studies and introduce practical strategies for working effectively with cross-functional roles, engineering teams, and third-party partners throughout the project development lifecycle. Join us to explore actionable approaches for fostering clear communication, building trust, and strong working relationships in fast-paced, cross-team environments.",
    "speaker_name(s)": "Yue Ding",
    "time": "Wednesday, November 05, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Thriving as the \"Only\" in the Room",
    "description": "",
    "speaker_name(s)": "Diane Boettcher",
    "time": "Wednesday, November 05, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Unbound and Balanced: Assertive Parenting for Professionals",
    "description": "This workshop empowers participants to master assertive, empathetic communication with hands on activities and practical tools to self-advocate, support family while thriving in the career of one's choice. Reduce Conflict: Navigate challenges without escalating tensions, leading to healthier relationships and less stress. Set Clear Boundaries: Balance work hours, meetings, and family commitments, protect well-being. Build Confidence: Practice to advocate for yourself in high pressure environments. Foster Connection: Assertiveness prioritizes connection over \"winning\" arguments, to strengthen trust, collaboration with everyone. Communicate Intentionally: Share clear, impactful messages, minime misunderstandings Learning Outcomes '95tGrasp five key principles of assertive communication for work-life balance. '95tPractice setting boundaries and communicating with intention. '95tStrengthen listening and clarity through hands-on group activities.",
    "speaker_name(s)": "Shivam Khullar, Smitha Sasidharan, Dan Kralovec",
    "time": "Wednesday, November 05, 09:00 AM 10:00 AM",
    "type": "Workshop",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Women Defending the Digital Frontier",
    "description": "",
    "speaker_name(s)": "Monika Tamber",
    "time": "Wednesday, November 05, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "AI-Powered Product Management: Using AI to guide product discovery and roadmapping",
    "description": "In product management, the greatest challenge isn't just building solutions, it's making sure we're solving the right problem for our customers. Too often, teams rush to deliver features without fully understanding the real needs behind user pain points, leading to wasted effort and missed opportunities. This session explores how AI can revolutionize product management by enabling teams to gather deeper customer insights, validate pain points, and prioritize what truly matters. We'll discuss practical, real-world techniques to leverage AI-powered tools, from intelligent user feedback analysis and trend detection to automating competitor and market research. Attendees will walk through frameworks for translating AI-driven insights into actionable product roadmaps and prioritization matrices.",
    "speaker_name(s)": "Elva Fernandez Sanchez",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Architecting Your Influence: Strategic Career Growth for Women Technologists Rising Into Leadership",
    "description": "This presentation empowers women technologists to architect long-term career strategies that align with leadership, national impact, and future-proof technical domains. You'll explore how to build influence beyond execution—by positioning yourself in high-growth fields like AI and cybersecurity, cultivating executive presence, and creating visibility through thought leadership, mentorship, and strategic contributions. Attendees will leave with a proven mindset shift and actionable roadmap to evolve from individual contributors to high-impact leaders, shaping the future of tech and driving innovation with purpose. This session is ideal for mid-career professionals ready for greater influence and legacy.",
    "speaker_name(s)": "Shilpi Mittal",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Beyond Dev & Ops: Packaging Intelligence in the Cloud and Managing It with AI Agents'ee",
    "description": "Cloud teams have already mastered the art of delivering infrastructure and software at scale—but the next frontier is delivering intelligence itself. This session shows how forward-looking organizations are encapsulating reasoning, planning, and decision-making capabilities into reusable \"Intelligence-as-a-Service\" layers and governing them with autonomous AI agents. We'll trace the journey from classic DevOps pipelines to AgentOps—where Digital teams curate prompt libraries, guardrails, and vector stores instead of RPMs and Docker files.",
    "speaker_name(s)": "Swati Singh",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Boardroom Innovators: Powering Corporate Transformation",
    "description": "Join Tony West, Chief Legal Officer and Corporate Secretary of Uber, for a dynamic conversation with Mandy Ginsberg, former CEO of Match Group; Patricia Nakache, General Partner at Trinity Ventures; and Stephanie Cohen, Chief Strategy Officer at Cloudflare. These accomplished women who are all board members of publicly traded companies will share how their experiences as CEOs and senior leaders shape their approach to governance, strategy, and innovation. Gain insider perspectives on driving transformation, fostering inclusion, and navigating complex challenges at the highest levels of business.",
    "speaker_name(s)": "Tony West, Mandy Ginsberg, Patricia Nakache, Stephanie Cohen",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Sponsored Session",
    "category": "Career Storytelling",
    "experience_level": ""
  },
  {
    "session_name": "Breaking Barriers, Building Bridges (Thriving as a Latina in Tech)",
    "description": "What does it mean to succeed in tech without having to shrink parts of who you are? In this session, Estefany, a Mexican born engineer with a decade of experience across Mexico and the U.S. will share her journey navigating the tech industry as a first-generation immigrant, Latina, and woman in STEM. From working in broadcast/audio to leading engineering operations at Amazon and advocating for DEI at scale, Estefany has faced and overcome challenges rooted in identity, isolation, and systemic bias. This talk will empower attendees to reframe their cultural background as a professional superpower, use storytelling to advocate for themselves and others, and build inclusive communities even in the most exclusive spaces. Attendees will walk away with a \"Resilience Toolkit\".",
    "speaker_name(s)": "Estefany Alanis",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Building a Career as an AI Product Manager: Navigating the intersection of technology, business, and people",
    "description": "This talk discusses the keys to building a successful career in AI product management, emphasizing the intersection of three critical areas: technology, business, and human experience, which are all essential to building compelling AI products. The discussion will focus on driving product impact with purpose.",
    "speaker_name(s)": "Lisa Huang",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Cloud-Native Development for Beginners",
    "description": "Cloud-native development may sound complex, but at its core, it's about building software that thrives in the cloud. This beginner-friendly session breaks down the essentials—cloud platforms (like AWS, Azure, GCP), containers (Docker), and scalable design principles—into digestible, real-world concepts. We'll walk through what it means to \"go cloud-native,\" how teams build resilient systems, and the foundational tools and mindsets that power modern development. If you've ever wondered how cloud apps scale or what containers actually do, this session is your launchpad.",
    "speaker_name(s)": "Sarah Igho Omoike",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Decoding Imposter Syndrome: Unmasking the Silent Struggle in Tech",
    "description": "",
    "speaker_name(s)": "Anuradha Malvadkar",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Embracing Cultural Identity for Professional Growth",
    "description": "In today's dynamic and ever-changing workplaces, cultural identity stands as a powerful asset. This panel unites women from various backgrounds, industries, and career stages to share their experiences on how embracing cultural identity can drive professional growth, leadership, and innovation. Panelists will reveal how their heritage, lived experiences, and cultural values have shaped their careers and empowered them to lead with authenticity. Through personal stories, practical strategies, and honest dialogue, this session will illuminate how cultural identity can be a catalyst for resilience, creativity, and connection. Attendees will gain valuable insights into navigating professional spaces without compromising their true selves—and leave inspired to view their own identities as sources of strength and empowerment.",
    "speaker_name(s)": "Ana Parada Mar, Melissa Delgado, Nadia Karim, Lily Kim",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Panel",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Fighting Financial Fraud with Data: A Research Journey into Identity Theft Detection in Banking",
    "description": "This session delves into cutting-edge cybersecurity research focused on detecting identity theft in the U.S. banking system. Using publicly available datasets and machine learning models, my study explores how demographic and behavioral patterns can signal fraudulent activity in real-time. Attendees will gain insight into the research process, from defining the problem and selecting features to training models and analyzing patterns across age groups and geographies. This talk emphasizes not only the technical contributions but also the social importance of protecting vulnerable users in the digital financial ecosystem.",
    "speaker_name(s)": "Emmanuella Acheampong",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "From Self-Doubt to Software: Rewiring Inferiority to Thrive in Tech",
    "description": "In this deeply personal and inspiring presentation, I'll share my journey of growing up with an inferiority complex and feeling like an \"average\" student — to eventually working on cutting-edge technologies in the global tech industry. This session is designed especially for students and early-career professionals who silently battle self-worth issues, imposter syndrome, and the pressure to \"stand out\" in an overly competitive world. Through the lens of my story, attendees will learn how to reframe limiting beliefs, build authentic confidence, and carve their own space in tech — not by being perfect, but by being persistent. This is not just a story of success, but a call to recognize the power in your unique journey, no matter where you begin.",
    "speaker_name(s)": "tejaswini sirlapu",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Human-Centered Monitoring: Designing Observability Tools with Empathy and AI",
    "description": "In the world of cloud-native systems, observability tools are everywhere—but they're not always built with the humans behind the dashboards in mind. Teams are drowning in alerts, fragmented data, and complicated UIs that often add stress instead of clarity. This session explores how we can flip the script. Drawing from real-world experiences in building large-scale observability solutions, we'll dive into what it means to design with empathy—where user experience, AI, and DevOps come together to create tools that actually help. We'll talk about designing for cognitive load, surfacing insights (not noise), and building interfaces that support thoughtful debugging and fast decision-making. Whether you're a Product Manager, engineer, or designer, you'll leave with practical strategies to build more intuitive, human-first observability experiences that empower teams, not exhaust them.",
    "speaker_name(s)": "Akanksha Kumari, Priyanka Mishra",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Hybrid Agile: Outperforming AI by Delivering Real Results",
    "description": "",
    "speaker_name(s)": "Dunia Alsaffar",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Impact Ripples: Amplifying Recognition Through Purpose",
    "description": "",
    "speaker_name(s)": "Amanda MacDonald, Sunaina Karve, LeeAnne Dewar",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "No CS Degree, No Problem: How I Went From Zero Coding Skills to a Career in Big Tech",
    "description": "In this talk, I'll share my journey from having no coding experience to building real-world skills at a small startup, and eventually leveling up again to land a software engineering role at a leading tech company. Along the way, I had to relearn how to learn, build without credentials, and develop the confidence to go after roles that once felt out of reach. This isn't a \"just teach yourself to code\" story. It's about learning in public, failing forward, and growing through every stage of the journey: from beginner to contributor to someone who now leads teams at a major tech company. Attendees will walk away with: - A realistic roadmap for self-teaching and leveling up - Tactical advice for landing that first job—even if it's not your dream job - How to close the gap between \"startup engineer\" and \"big tech-ready\" - Tips on surviving the imposter syndrome that never fully goes away",
    "speaker_name(s)": "Elaina Polson",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "The Invisible Engine: Optimizing AI for the Cloud Without Breaking the Bank",
    "description": "The rise of cloud-based AI has unlocked unprecedented computing power, but poorly optimized models can skyrocket costs, waste energy, and slow down performance. This talk explores how to fine-tune machine learning algorithms for cloud environments covering: Efficient AI deployment strategies (reducing GPU usage, optimizing model parallelism) Auto-scaling ML workloads for cost-efficient execution The trade-offs between accuracy and compute efficiency How women in AI can lead the shift toward cloud-optimized, sustainable AI solutions With real-world case studies (including my NeurIPS research), this session is designed to help AI practitioners build smarter, faster, and more affordable AI models in the cloud.",
    "speaker_name(s)": "Kaustubha V",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "The Manager's Edge: Unlock Your Mentoring Superpowers",
    "description": "When I moved from an individual contributor role as a QA engineer to a software development manager, I found that mentoring was a key component of managing that wasn't a skill often taught. Managers need to develop skills beyond project management and task completion to deliver results. Mentoring is a crucial skill managers need to know to create a team where people want to stay and perform their best. In this session I will share mentoring techniques that will supercharge your leadership skills based on my own learnings of what does and doesn't work. I will explain the three components of mentoring: coaching, teaching, and advising and a simple decision tree that will help you create a mental model of when to use each. Then I'll share real-world scenarios to illustrate how to employ the three components to develop people's talents, boost engagement, and build connection.",
    "speaker_name(s)": "Rajni Hatti",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "The Math Behind the Magic: Understanding the Role of Mathematics in Deep Learning",
    "description": "Deep learning often feels like magic — models that recognize faces, translate languages, or even generate art. But under the hood, it's mathematics doing the heavy lifting. In this session, we'll demystify the math that powers deep learning and uncover how key mathematical concepts like linear algebra, calculus, probability, and optimization come together to make neural networks work. This isn't a lecture — it's an intuitive walkthrough that connects math to real AI applications. You'll walk away with practical insights into how math helps build smarter models, debug issues, and innovate responsibly in AI.",
    "speaker_name(s)": "Aditya Mehra, Mahima Bansod",
    "time": "Wednesday, November 05, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Designing Financial Empowerment for All Minds",
    "description": "Today's financial wellness landscape is uniquely challenging. As people live longer and face shifting retirement realities, many rely on digital platforms to build the future they hope for. Yet most fintech tools still follow a one-size-fits-all design, overlooking the needs of neurodivergent individuals who accounts for up to 20% of the population. Women often face greater challenges, as they are frequently underdiagnosed or misdiagnosed due to gender-biased diagnostic criteria. This hands-on workshop challenges the status quo. By embracing neurodiversity as a design advantage, we'll explore how inclusive fintech can empower all users. Through real-world simulations grounded in User-Centered Design, participants will discover emotionally intelligent strategies that are flexible, forgiving, and human-centered. We'll also explore how emerging technologies like AI and adaptive interfaces can unlock more intuitive and accessible financial experiences for all minds.",
    "speaker_name(s)": "Arian Clay-Sirop, Max Tkach, Katie Zhang",
    "time": "Wednesday, November 05, 10:30 AM 11:30 AM",
    "type": "Workshop",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Mastering Microsoft Power BI and Fabric with Copilot: Your Gateway to Data Excellence",
    "description": "Dive into the world's leading business intelligence platform with this interactive workshop designed for all skill levels. In just 60 minutes, you'll go from Power BI novice to creating professional dashboards and understanding Microsoft's revolutionary Fabric ecosystem. Through guided hands-on activities, you'll connect to real data, build compelling visualizations, and learn how these tools drive data-informed decisions across industries. Additionally, we will demonstrate how to effectively use Power BI Copilot to extract meaningful insights from data, streamlining your analysis process. Whether you're exploring careers in business intelligence, data analysis, or simply want to add a highly marketable skill to your portfolio, this workshop provides practical experience with tools used by over 90% of Fortune 500 companies. Leave with working dashboards, practical skills you can immediately apply, and a roadmap for continued growth in the booming field of data analytics.",
    "speaker_name(s)": "Neha Ghaty Satish, Ojal Mapuskar, Grace Gong",
    "time": "Wednesday, November 05, 10:30 AM 11:30 AM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "The Fire You Carry: What Female Rage Can Teach Tech",
    "description": "Anger is often dismissed as unprofessional, especially when it comes from women. But what if rage isn't a weakness, but a signal? In this unapologetic session, we explore how female rage, at exclusion, burnout, or broken systems, can be a powerful tool for clarity, boundary-setting, and transformation. Through personal stories and practical tools, we'll reframe rage as data, activism, and leadership fuel. You'll leave with language, frameworks, and community for building something better.",
    "speaker_name(s)": "ToAnh Tran, Kerri-Leigh Grady, Ana Gosseen, Zhamara Reano",
    "time": "Wednesday, November 05, 10:30 AM 11:30 AM",
    "type": "Workshop",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Thriving Unbound: Building Mental Resilience in Tech's Fast Lane",
    "description": "The demanding nature of the technology sector frequently results in burnout, anxiety, and compromised well-being, with particularly significant impacts on women and non-binary professionals. This engaging workshop provides participants with practical tools to prioritize mental health while achieving success in the tech industry. Participants will discover research-backed approaches to prevent burnout, effectively manage stress, and develop resilience through mindfulness practices and healthy boundary establishment. The session incorporates mindfulness meditation techniques, controlled breathing exercises (pranayama), and accessible yoga positions (asana) specifically designed for implementation in technology workplace settings. Through hands-on demonstrations and concrete implementation strategies, attendees will acquire practical methods to incorporate resilience-building practices into their everyday workflows, fostering both personal development and professional advancement.",
    "speaker_name(s)": "Anjani Reddy, Snehal Nahar, Sandy Kingdon",
    "time": "Wednesday, November 05, 10:30 AM 11:30 AM",
    "type": "Workshop",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "I Can Fit That In: The New Rules of Energy, Capacity, and Sustainable Performance",
    "description": "What if the secret to doing more wasn't managing your time, but stewarding your energy? Based on Erin's book I Can Fit That In, this keynote redefines productivity for the modern leader. Erin teaches how to protect your energy, align your time with your values, and perform without burnout. It's not about fitting more in—it's about fitting in what matters most. Audience Takeaways: u003culu003e tu003cliu003e'a0Shift from time management to energy stewardshipu003c/liu003e tu003cliu003eCreate rituals that restore vitality and focusu003c/liu003e tu003cliu003eLet go of outdated beliefs around overcommitment, busyness and self-worthu003c/liu003e tu003cliu003eReclaim your time, presence, and poweru003c/liu003e u003c/ulu003e",
    "speaker_name(s)": "Erin Coupe",
    "time": "Wednesday, November 05, 11:30 AM 12:00 PM",
    "type": "Featured",
    "category": "",
    "experience_level": ""
  },
  {
    "session_name": "Level Up: Gaming for the Generations",
    "description": "This session will explore how gaming is for every generation. Adults 50+ are engaging with video games, brain-training apps and interactive technologies not only for fun, but also for cognitive health, social connection and stress relief. Through a dynamic conversation and interactive elements, participants (audience consists of mostly women who are in the tech industry, but men are invited) will learn how play can strengthen memory, attention and problem-solving skills while also reducing loneliness and fostering community. Together, we'll connect the dots between wellness, culture and the growing role of gaming in everyday life for aging adults.",
    "speaker_name(s)": "",
    "time": "Wednesday, November 05, 12:30 PM 01:15 PM",
    "type": "Sponsored Session",
    "category": "Technology",
    "experience_level": ""
  },
  {
    "session_name": "Breaking Industry Boundaries: How to Successfully Reinvent Your Career",
    "description": "From mechanical engineering in power plants to advertising tech, my career path demonstrates that industry boundaries are meant to be crossed. I would lead a session on practical strategies for successful career transitions, drawn from my journey through engineering, chemical operations, AWS data center supply chain, and now customer experience in Amazon advertising. I'll share how one can leverage their unique background to create opportunities in unexpected places.",
    "speaker_name(s)": "Atulya Kumari",
    "time": "Wednesday, November 05, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Bridging the Gap: How to Thrive in Software Engineering Beyond Academia",
    "description": "How is software engineering in industry different from what you learn in a university classroom? How do you prepare to contribute to large codebases and write code that impacts millions of clients? If you find yourself asking these questions, join us to learn from software engineers that were in your shoes not too long ago. This workshop will cover technical tips on how to write production-ready code that is stable, maintainable, and observable, along with common pitfalls that entry-level engineers often face. This session is designed for recent graduates, interns, career changers, and all entry-level engineers looking to contribute impactfully from the start. No matter where you're starting from, this session will empower you with the tips and confidence needed to navigate the early years of your career with success!",
    "speaker_name(s)": "Ioana-Roxana Pandelea, Neha Ranade",
    "time": "Wednesday, November 05, 01:00 PM 02:00 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Code Bound: How Apprenticeships Forge the Future of Tech",
    "description": "Join us for a dynamic session on the AnitaB.org Apprenticeship Pathway Program (APP), bridging the numbers with the narratives. The session will begin highlighting the measurable impact of apprenticeship programs—covering key metrics like career progression, belonging, and workforce development. Then, settle in for an intimate fireside chat with two program alumni who will share their journeys, challenges, and triumphs. This session offers a glimpse into how policy and programming translate into lived experience. Whether you're a talent strategist, educator, or industry leader, you'll walk away with both the evidence and the empathy needed to champion apprenticeship pathways in your organization.",
    "speaker_name(s)": "Anny Patino, Erika Karsh, Marlena Roberson-Bullard, Voke Elstein",
    "time": "Wednesday, November 05, 01:00 PM 01:45 PM",
    "type": "Panel",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Code, Circuits & Courage: Immigrant Journey in Tech",
    "description": "Building a career in the tech industry is challenging enough—but doing it as an international student adds another layer of complexity. From navigating immigration systems to adapting to new cultures, and from pursuing a Master's degree in a foreign country to landing roles at top tech companies, this panel brings together four women who've successfully made that journey. Each of us represent a unique path—we come from different backgrounds, and now work at leading companies like Apple, Microsoft, Nvidia, and Google. We'll share candid reflections on what it takes to build a career in tech as an immigrant or international student, including how we tackled: - Navigating job searches and visa challenges - Building networks in a new country - Making strategic career moves in highly competitive environments - We'll also open up about the emotional and mental resilience required, the support systems that helped us thrive, and the importance of community in navigating these transitions.",
    "speaker_name(s)": "Sweta Shivaramakrishnan, Sushmitha Muthukumar, Saranya Krishnakumar, Roopana Vuppalapati Chenchu, Sruthi Shivaramakrishnan",
    "time": "Wednesday, November 05, 01:00 PM 01:45 PM",
    "type": "Panel",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Eat. Sleep. AI. Repeat: Building a Career That Keeps Up with the Bots!",
    "description": "As AI transforms software engineering—boosting productivity, and reshaping roles it raises key questions: Do engineers need to pivot entirely to AI to stay relevant? How can I master AI while staying up to date with industry skills and keeping my passion for full-stack development? This talk explores how to stay true to SWE while building AI fluency. We'll guide you through learning AI basics, integrating AI tools into your workflow, and adapting to an AI-driven world. AI isn't here to replace engineers—it enhances their work, from writing code to automating tests. We'll cover the benefits of AI, essential skills for staying competitive, and how to integrate AI without losing touch with hands-on development. You'll learn to balance AI knowledge with core software engineering skills, fostering creativity and problem-solving. Whether new to AI or hesitant to embrace it, this session offers practical advice for blending both worlds and staying future-proof in an evolving industry.",
    "speaker_name(s)": "Vrushanki Patel, Amogha Bhardwaj",
    "time": "Wednesday, November 05, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "From Agents to Allies: Empowering Technologists with Multi-Agent AI Workflows",
    "description": "This session is built for technologists who want to understand how multi-agent systems work, build them from the ground up, and be part of the rapidly growing ecosystem shaping their future. Instead of abstract concepts, we'll explore this shift through real-time demos and an honest, practical look at the tools and frameworks available today.",
    "speaker_name(s)": "Nghiem Doan, Menaka Kollu, Lakshmi Sindhuja Karuparti",
    "time": "Wednesday, November 05, 01:00 PM 02:00 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Gemini in BigQuery: AI for Everyone and Accessible, Cloud-Agnostic Data Innovation for Women in Tech",
    "description": "Join us for a dynamic session where women in tech lead the charge in unlocking AI's true potential in data engineering. Discover how Gemini in BigQuery makes AI accessible and cloud-agnostic, empowering everyone—from analysts to engineers—to automate, optimize, and transform data pipelines. Learn about smart SQL code generation, comprehensive code explanation and completion, and innovative Python code generation techniques. Experience hands-on demonstrations with an interactive data canvas and streamlined data preparation that can radically simplify your workflows. Cut through the hype and focus on impactful, customer-driven outcomes as we showcase how AI is democratizing data innovation, enhancing efficiency, and delivering real business insights. Embrace the future of data-centric tech with tools that empower every data worker.",
    "speaker_name(s)": "Natalia Girolamo",
    "time": "Wednesday, November 05, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Hello World, Meet Me: A Workshop on Personal Branding using AI",
    "description": "Overview: This workshop is designed to empower women in tech to communicate with confidence, creativity, and authenticity in professional environments. Leveraging AI tools, participants will learn how to master the art of introductions, elevator pitches, and personal branding in a way that's anything but boring. -------------------------------------------------------------------------------- Objectives: 1. Learn how AI can assist in crafting compelling elevator pitches. 2. Create a unique introductory note that stands out from mainstream clich'e9s. 3. Explore creative tools to visualize and enhance personal branding. 4. Gain confidence in real-world and digital networking scenarios. 5. Understand how to maintain authenticity while using AI-generated content.",
    "speaker_name(s)": "Neha Bassi, Gaurav Khanna",
    "time": "Wednesday, November 05, 01:00 PM 02:00 PM",
    "type": "Workshop",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Leading Engineering teams by bridging the Gap between Tech and Business",
    "description": "As an Engineering Manager / Tech Leader, you are a building block holding the engineering and technical pillars. You also act as a translators between tech and business stakeholders. However, because of this gap often leads to misaligned priorities, decisions without incorrect research which can lead to frustration and loss of $$ for the company. As a leader, your team's and company's success relies not just on your technical expertise, but also your understanding of the moving business ask. This session would help enlighten on : - Differences between business and technical priorities - Communication Barriers - Conflicting View resolution - Encouraging Long term vision for the product",
    "speaker_name(s)": "Purva Sawant",
    "time": "Wednesday, November 05, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Lights, Camera, Pivot: How a Life-Altering Moment Inspired My Career Reinvention",
    "description": "Ever felt stuck on a career path that wasn't aligning with your passions? Sometimes it takes life's unexpected plot twists to rewrite our stories. Join me for a heartfelt and deeply personal session as I share my unconventional journey from defense engineering to theme parks, cruise ships, marketing - and ultimately filmmaking. When faced with a life-altering medical decision, I chose to embrace the unexpected, channeling my experience into my passion project: producing my own film. Learn how your existing skills can serve as your personal script for an exciting career pivot into fields you've dreamed of but never pursued. Come prepared for laughter, reflection, and inspiration to courageously step into your next chapter, no matter how untraditional.",
    "speaker_name(s)": "Jessica Kennedy Vickers",
    "time": "Wednesday, November 05, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Mastering the Corporate Maze: Unlocking Success Beyond the Code",
    "description": "Join us for an exclusive workshop designed to empower students and professionals to thrive in today's dynamic corporate environments. Led by experienced leaders, Shawn McCarthy and Vivien Wong, this session will delve into the unique challenges and opportunities that extend beyond technical expertise. Participants will explore skills such as relationship management, effective communication, strategic networking, and compelling business storytelling. These competencies are crucial for navigating the complex matrix structures of leading organizations. Whether you're aiming to expand your career horizons or unlock new possibilities, this workshop is your gateway to mastering the art of corporate success. Engage in interactive activities, gain insights from real-world scenarios, and learn how to leverage digital channels and internal communications to drive innovation and impact. Don't miss this opportunity to enhance your professional toolkit and step confidently into the corporate arena.",
    "speaker_name(s)": "Vivien Wong, Shawn McCarthy",
    "time": "Wednesday, November 05, 01:00 PM 02:00 PM",
    "type": "Workshop",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Own the Room, Shape the Roadmap: Finding Your Voice as an EiC PM",
    "description": "As a product or program manager early in your career, it can feel intimidating to speak up in rooms full of senior engineers and decision-makers. This session empowers EiC PMs to build confidence, influence without authority, and develop the strategic voice needed to drive alignment, customer obsession, and innovation. Panelists will share real-world tactics to earn trust, lead with clarity, and grow into impactful change agents—no matter your title.",
    "speaker_name(s)": "Mehak Vij",
    "time": "Wednesday, November 05, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Release Your Mind for Success: How Women Leaders Achieve Success Without Sacrificing Themselves",
    "description": "The evolution of the workplace, hybrid, remote, and return-to-office, has redefined how we balance professional and personal lives. Join accomplished women leaders from technology, consulting, and public sectors as they reveal real-world strategies for empowered mental health, dealing with stress, setting boundaries, and achieving sustainable success. Learn how they navigate stress, manage expectations, embrace strategic projects, and still prioritize personal wellness & growth. We will explore - Setting effective boundaries & managing team expectations. - Embracing work involving strategic initiatives - Prioritizing mental health - Ways to refresh the mind while making a global impact - Building sustainable career growth while maintaining personal priorities - Leveraging technology and tools for better time management This panel delivers proven strategies from leaders who've thrived amid evolving work models. Walk away with actionable tactics and a mindset shift for the future of work",
    "speaker_name(s)": "Andrea Peng, Smriti Singh, Lily Wong, Ramu Murakami Gutierrez",
    "time": "Wednesday, November 05, 01:00 PM 01:45 PM",
    "type": "Panel",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Server-Driven UI: LinkedIn's Journey to Accelerated UI Development",
    "description": "In a world where software development must be fast, consistent, and adaptive across platforms, server-driven UI (SDUI) has emerged as a powerful approach to accelerate front-end development. This panel will explore how LinkedIn's adoption of SDUI empowers teams to build once and deploy seamlessly across web, iOS, and Android — reducing time-to-market while maintaining a cohesive, high-quality user experience. We'll unpack the key benefits of SDUI, like accelerated UI development, platform consistency, and seamless migrations. Our panelists will dive into critical architectural decisions: what belongs in the foundation (infra) vs. feature (product) layers, and what should remain configurable vs. locked down to preserve UX consistency. With voices from across engineering — spanning platforms, infra teams, product leads, and DevX tool creators — this session will bring diverse perspectives on the challenges, solutions, and real-world impact of SDUI at scale.",
    "speaker_name(s)": "Jing Zhao, Lucy Lin, Eidarli Aung, Karen Tseng, Cleo Chow",
    "time": "Wednesday, November 05, 01:00 PM 01:45 PM",
    "type": "Panel",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Show Up, Speak Up, and Stand out: Make an impact at your workplace",
    "description": "LET ME GUESS... u8594 You're a skilled professional who contributes consistently but feels your ideas aren't making the impact they deserve u8594 You see colleagues confidently shaping discussions and wonder how they command such influence u8594 You're good at your job, but feel invisible in meetings and decision-making processes YOU'RE HELD BACK BY: u8594 Uncertainty about when and how to contribute meaningfully u8594 Fear of speaking up in high-stakes environments u8594 Imposter syndrome when surrounded by vocal colleagues u8594 Worry about being perceived as too passive THEN THIS SESSION IS FOR YOU! In this session, I'll share u8594 Actionable techniques to amplify your voice in meetings and decision forums u8594 How to build and leverage your unique technical perspective u8594 Practical ways to communicate complex ideas with clarity and confidence u8594 Real examples of how small visibility shifts led to major career opportunities u8594 Building a reputation that extends beyond your immediate team See you there!",
    "speaker_name(s)": "Teena Idnani",
    "time": "Wednesday, November 05, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Strong, smart, struggling: Let's Talk Mental Health in Tech",
    "description": "In tech, mental health is often the last thing we talk about—but the first thing to suffer. As a first-time mom returning to work in tech, I've experienced the mental load many women quietly carry. This pressure is intensified by burnout, imposter syndrome, and the need to prove themselves. Through storytelling, myth-busting, and guided reflection, this session opens space for honest conversation, community connection, and practical strategies to protect your emotional well-being. Whether you're a team lead, a junior dev, or just feeling the weight of always being \"on,\" this talk will offer insights, tools, and a powerful reminder: you are not alone.",
    "speaker_name(s)": "Ravisha S K",
    "time": "Wednesday, November 05, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Tech That Cares: Redesigning AI for Children, Citizens, and the Planet",
    "description": "My journey as a CTO and AI architect has taken me into some of the most high-stakes and human-centered environments — implementing generative AI for citizen services, leading AI architecture for a UN-powered sustainability platform, and co-founding a nonprofit to safeguard children from the harms of artificial intelligence. These diverse, real-world experiences have shaped how I approach technology: not just as a system builder, but as a steward of safety, equity, and care. This session is for technologists who believe AI can and should serve the public good — but who also recognize that good intentions aren't enough. You'll also learn how we're building AI chatbots for citizen services and RAG-based solutions to reduce misinformation, and AI for sustainability. This talk goes beyond \"bias in training data\" to uncover the systemic challenges in public sector AI — limited compute, conflicting incentives, and communities that are too often left out of the design process.",
    "speaker_name(s)": "Swathi Young",
    "time": "Wednesday, November 05, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "The GPU: Powering the AI Revolution",
    "description": "GPUs are at the heart of the modern AI revolution, transforming how we train and deploy machine learning models. Unlike CPUs, which handle a few tasks at a time, GPUs are designed for massive parallel processing, making them ideal for the matrix-heavy operations in deep learning. Originally built for graphics rendering, GPUs have evolved into powerful general-purpose processors thanks to tools like CUDA and AI frameworks such as TensorFlow and PyTorch. They enable rapid development of large-scale models used in language generation, image synthesis, autonomous systems, and more. As AI models grow in size and complexity, GPUs continue to push the boundaries of what's possible, accelerating innovation across industries and shaping the future of intelligent technologies.",
    "speaker_name(s)": "Manasi Rashinkar",
    "time": "Wednesday, November 05, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Unlocking Research as an Undergrad: How to Dive Into Discovery Early",
    "description": "Undergraduate research isn't just for future academics — it's one of the most powerful ways to deepen your learning, gain hands-on experience, and stand out in your career. This session explores the major benefits of doing research as a student, from building critical thinking and problem-solving skills to expanding your professional network and strengthening your resume. I'll share insights from teaching a class of 35 high school students about the world of undergraduate research: what kinds of projects students work on, what skills they develop, and how those experiences open doors to internships, graduate programs, and leadership roles. Whether you're curious about contributing to cutting-edge technology, exploring big questions, or simply leveling up your college experience, this talk will show you why research is worth it.",
    "speaker_name(s)": "Stuti Agrawal, Anumeha Agrawal",
    "time": "Wednesday, November 05, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Vibe Coding for Leaders",
    "description": "Join Wall Street Journal bestselling author Gene Kim and AI coding pioneer Steve Yegge for an interactive session on the future of software development. Drawing from their upcoming book Vibe Coding, they'll share how AI is transforming how we build, collaborate, and innovate. Learn practical ways to work with AI coding tools, adapt engineering practices, and embrace new levels of speed, creativity, and autonomy in your teams.",
    "speaker_name(s)": "Gene Kim, Steven Yegge",
    "time": "Wednesday, November 05, 01:00 PM 02:30 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": ""
  },
  {
    "session_name": "Zero to Fifty: Engineering sub-50ms IAM architecture for high-stakes gaming platforms",
    "description": "In the competitive world of online gaming, every millisecond of authentication delay directly impacts user experience, revenue, and security. To address these challenges, we will introduce an innovative identity and access management architecture that consistently achieves sub-50ms authentication speed. This architecture leverages cutting-edge technologies such as multi-factor authentication (MFA), single sign-on (SSO), and advanced cryptographic algorithms to ensure both speed and security. Our session will delve into the best engineering practices, including the use of serverless computing to optimize performance. We will provide implementation details, covering aspects like identity proxy, authorization, the integration of AI-driven anomaly detection to enhance security. Additionally, we will present measurable results from various case studies, demonstrating how our architecture has successfully reduced authentication times and improved user satisfaction in real-world scenarios.",
    "speaker_name(s)": "Aditi Mallesh, Richa Sourabh",
    "time": "Wednesday, November 05, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Beyond Burnout: Thriving in Big Tech's Fast Lane",
    "description": "In this age of rapid change, high expectations and a go, go work environment and culture, how do we show-up, do excellent work, yet not overachieve to the point of exhaustion and breaking ourselves physically and mentally. We will share what signs to look for in burning out and how you can both prevent and recover from burn-out through candid personal stories from tech professionals. Stories will include how relentless pressure and perfectionism can push even the most passionate workers to the brink of exhaustion with a focus on recovery and resilience: how to set healthy boundaries, seek support, and redefine success to break the burnout cycle. Attendees will gain practical strategies '96 from unplugging without guilt to finding balance and purpose '96 that help transform burnout from an ending into a new beginning. With the right approaches, it's possible not just to recover, but to thrive in tech with renewed energy and fulfillment.",
    "speaker_name(s)": "Saloni Yadiv, Sara Fratianne, Melissa Delgado, Lily Kim",
    "time": "Wednesday, November 05, 02:15 PM 03:00 PM",
    "type": "Panel",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Combating Stereotypes in Tech",
    "description": "This panel brings together senior leaders and changemakers to explore how stereotypes—whether based on gender, race, age, background, or role and continue to shape the tech industry. Through candid conversation and lived experiences, panelists will unpack the impact of these biases on innovation, leadership, and career progression. Attendees will gain actionable insights on how to challenge assumptions, foster inclusive cultures, and lead with intention in environments where diversity is both a strength and a necessity.",
    "speaker_name(s)": "Sirisha Garapati, Marivi Stuchinsky, Meg Roughen, Marizette Galvez, Doreen Viloria",
    "time": "Wednesday, November 05, 02:15 PM 03:00 PM",
    "type": "Panel",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Creating Psychologically Safe Tech Workplaces: Bridging the Gap Between Performance and Wellbeing",
    "description": "The tech industry's high-pressure environment has created unprecedented mental health challenges. This panel brings together diverse experts to explore the intersection of wellbeing and tech workplace culture. Our panelists, Software Development Manager, Head of Data & AI, Business Intelligence Engineers and Technical Program Manager will guide discussions on controversial topics like productivity vs. wellbeing and remote work's impact on mental health. Through dynamic exchanges, we'll examine core debates around performance metrics versus wellness measures and company obligation in mental health support. The session will provide attendees with understanding of tech-specific challenges, practical strategies for building resilient work cultures, and skills in recognizing stress signs and setting boundaries. Join us in reimagining a tech industry where mental health is actively prioritized through actionable approaches for both individual and organizational change.",
    "speaker_name(s)": "Siddhi Patil, Liza Ogwel, Shamina Merchant",
    "time": "Wednesday, November 05, 02:15 PM 03:00 PM",
    "type": "Panel",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Data that Delivers: How to Meet Both ESG and ROI Goals",
    "description": "In this presentation, participants will explore how to transform Environmental, Social, and Governance (ESG) initiatives into measurable outcomes that drive business success. While many organizations aim to pursue ESG goals, they often struggle with aligning these objectives to tangible business results. This session will provide insights on how to define, measure, and track ESG performance while linking it directly to Return on Investment (ROI), ensuring that both goals are actionable and valuable to business decision-makers.",
    "speaker_name(s)": "Amee Gil",
    "time": "Wednesday, November 05, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Designing Beyond the Vibes: Building Secure, Scalable Software in the GenAI Era",
    "description": "",
    "speaker_name(s)": "Kayla Kerrigan, Christine Tu, Ashish Depankaj, Janet Onyeche Audu, Udita Gupta",
    "time": "Wednesday, November 05, 02:15 PM 03:00 PM",
    "type": "Panel",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Frontier Firms in Action: Microsoft's playbook for AI skill adoption",
    "description": "",
    "speaker_name(s)": "Elisa Graceffo",
    "time": "Wednesday, November 05, 02:15 PM 03:00 PM",
    "type": "Sponsored Session",
    "category": "",
    "experience_level": ""
  },
  {
    "session_name": "Multiple Career Paths to Robotics",
    "description": "Hear the stories of multiple women who have found a career in robotics '96 traditional, non-traditional, academia, industry, startups. Software, hardware and more! We will use the field of robotics as a case study in how there are many paths into a career field, but also cover advice and tips that are broadly applicable to getting into any field complementary to computer science. There will be plenty of time for an interactive Q&A with the audience.",
    "speaker_name(s)": "Annika Wollschlaeger, Laura Herlant, Elizabeth Mittmann, Harshita Bhurat, Dawn Wendell",
    "time": "Wednesday, November 05, 02:15 PM 03:00 PM",
    "type": "Panel",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Preserving the Magic: Finding Joy and Purpose in Uncertain Times",
    "description": "In moments of burnout, instability, or personal struggle, it can be difficult to remember why we started. Holding onto the spark that brought us to tech is, in itself, a technical skill that we can all refine. Join Software Engineers from The Walt Disney Company as they share their stories and hard-earned strategies for staying grounded and hopeful amid the chaos. This includes not only seeking resources and fulfillment outside of work, but also advocating for accommodations and building community within the workplace. This discussion will center emotional intelligence, self-awareness, self-advocacy, and fostering community as career-critical tools, inviting attendees to explore how \"soft\" skills can build resilience, especially in unpredictable times. From chronic health issues to caregiving responsibilities to career anxiety, we will reflect on how to reconnect with purpose, embrace vulnerability, nurture unity, and cultivate joy — how to find the light when the future is unclear.",
    "speaker_name(s)": "Gauri Mishra, Lilith Matthews, Natalie Goldstein, Ifteda Ahmed-Syed",
    "time": "Wednesday, November 05, 02:15 PM 03:00 PM",
    "type": "Panel",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Scaling Magic: Engineering Disney'eds Real-Time Messaging Platform",
    "description": "How does Disney ensure millions of users receive the right message at the right time? From real-time sports alerts on ESPN+ to Disney+ content recommendations, messaging is a critical component of user engagement. Behind the scenes, engineers must build scalable, resilient systems to deliver personalized, high-volume notifications across multiple platforms. Join engineers from Disney's Messaging Platform team as they discuss the challenges of building and maintaining a large-scale messaging system. This panel will dive into backend architecture, personalization strategies, and real-time data pipelines that power Disney's messaging experiences. Learn how the team ensures reliability, optimizes system performance, and leverages AWS cloud infrastructure to support millions of messages daily. Whether you're interested in backend engineering, distributed systems, or real-time messaging, this session will provide insights into the technical backbone that keeps Disney fans connected.",
    "speaker_name(s)": "Stephanie George, Susana Rodriguez-Coria, Emma Koslow, Natalie Ng",
    "time": "Wednesday, November 05, 02:15 PM 03:00 PM",
    "type": "Panel",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Socially Responsible Tech -- Why Bother?",
    "description": "Why invest in creating socially responsible technology? After all, creating more responsible tech is hard, expensive, and likely less profitable. What reward and organizational structures are needed to enable companies and universities to support responsible tech, and \"grow\" socially responsible technologists? Attendees will hear about how the public sector, academia and industry view the value of socially responsible innovation, design and development, and what matters most to companies in this challenging climate. Why does social responsibility matter and what strategies are effective in promoting responsible tech? The panel will be moderated by Fran Berman, Director of the Public Interest Tech (PIT) Initiative at UMass. Panelists include Emily Nutwell, PIT Pathways Director at UMass, Kathy Pham, VP of AI at WorkDay, Josh Greenberg, Program Director at the Sloan Foundation, and Michelle Shevin, founder of the Future Preservation Society.",
    "speaker_name(s)": "Josh Greenberg, Kathy Pham, Francine Berman, Emily Nutwell, Michelle Shevin",
    "time": "Wednesday, November 05, 02:15 PM 03:00 PM",
    "type": "Panel",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Stories from the Trenches: Women Building Tech",
    "description": "",
    "speaker_name(s)": "Lilia Abaibourova, Monalisa Chati, Sophia Gu, Muazma Zahid",
    "time": "Wednesday, November 05, 02:15 PM 03:00 PM",
    "type": "Panel",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Streaming Magic: Stories From Women Building the Future of Video Delivery at Disney",
    "description": "At Disney, storytelling is at the heart of everything we do — even as technologists powering global streaming distribution. In this panel, four women across Disney's Media Engineering org — spanning ML to product — share stories of working at a legacy media giant that's also building the future of streaming. From early-career ICs to working moms in leadership, each panelist shares their unique lens.",
    "speaker_name(s)": "Lisa Flaherty, Amy Ma, Siri Talatam, Tiffeny Chen",
    "time": "Wednesday, November 05, 02:15 PM 03:00 PM",
    "type": "Panel",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Switching Industries: Tech Careers Without Borders",
    "description": "A panel discussion featuring women in technology whose careers have spanned multiple sectors, sharing their experience leading across different domains. The panel will cover topics such as navigating transitions, learning new industries, and how leadership evolves across sectors. The session will be insightful, practical, and empowering for those interested in exploring!",
    "speaker_name(s)": "Joy Laibl, Shakira Kelly, Haiben Chin, Dana-Nicole Samuel",
    "time": "Wednesday, November 05, 02:15 PM 03:00 PM",
    "type": "Panel",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Tech's Career Compass: Navigating the Leadership Career Crossroads Journey",
    "description": "To manage or not to manage? That is the question many rising tech stars face as they reach a career crossroads. Join accomplished women leaders as they share their journeys navigating the fork between individual contributor and management paths. Learn how they evaluated their strengths, interests and impact to chart fulfilling careers - whether as technical visionaries, people leaders, or both. Discover why leadership isn't limited to management titles and how you can craft a winding career path aligned to your evolving goals. Walk away with strategies to make this pivotal decision based on your authentic self, not external expectations.",
    "speaker_name(s)": "Shruti Mehrotra, Sujatha Guthikonda, Sarah Henrikson, Ramani Sankavaram, Michelle Perroton",
    "time": "Wednesday, November 05, 02:15 PM 03:00 PM",
    "type": "Panel",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "What's in a name? A Career Exploration Panel for Tech Roles",
    "description": "What does a Technical Program Manager actually do? How is a Data Scientist's job different from a Software Engineer's? And how do people end up in these roles in the first place? This session brings together three Microsoft engineers—one Software Engineer, one Data Scientist, and one Technical Program Manager—to break down what their jobs really involve, how they got there, and what surprised them along the way. From community college to early college, tutoring startups to teaching CS, each panelist brings a unique story of exploration, uncertainty, and figuring it out as they go. Moderated by Kelsea Pullin, whose career centers on mentorship and uplifting others, the panel will cover how these roles collaborate, what setbacks shaped their journeys, and the myths people often believe about their jobs. Attendees will walk away with clearer expectations, relatable stories, and encouragement to explore paths that might not look traditional—but still lead exactly where they're meant to go.",
    "speaker_name(s)": "Amanda Ong, Teresa Rexin, Nana Wu, Mounika Vanka",
    "time": "Wednesday, November 05, 02:15 PM 03:00 PM",
    "type": "Panel",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "AI safety controls at scale in the cloud",
    "description": "This session offers developers a practical deep dive into creating responsible AI systems. This talk addresses the critical need for content safety and policy compliance in AI applications, demonstrating how to implement effective guardrails. Through live demos and real-world examples, attendees will learn to set up denied topics, configure content filters, and integrate safety measures with AI agents. We'll explore the architecture of the solution, best practices for implementation, and strategies for testing and validation. Whether you're a seasoned ML engineer or just starting with generative AI, you'll gain valuable insights into balancing AI functionality with ethical considerations. Join me to acquire the tools and knowledge needed to develop AI applications that are not only powerful but also aligned with organizational policies and safety standards.",
    "speaker_name(s)": "Winnie Chen-Kraemer, Tiffany Chen, Laura Salinas",
    "time": "Wednesday, November 05, 02:30 PM 03:30 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Design Like a Pro: From Empathy to Prototype in 60 Minutes",
    "description": "Have an idea but not sure where to start? In this hands-on design thinking workshop, you'll learn how to turn your ideas into low-fidelity prototypes and communicate them with clarity and impact. Led by Adobe and Google professionals, this session will walk you through a simplified design thinking process — from user empathy to paper prototyping — all without needing to code or design digitally. Walk away with a tangible prototype and the confidence to share and iterate on your ideas.",
    "speaker_name(s)": "Aimen Moten, Jaiden Price",
    "time": "Wednesday, November 05, 02:30 PM 03:30 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Force multiplying mentoring",
    "description": "",
    "speaker_name(s)": "Sunaina Karve, Melissa O'Brien",
    "time": "Wednesday, November 05, 02:30 PM 03:30 PM",
    "type": "Workshop",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Revolutionizing Technology Workflows with AWS PartyRock: A Hands-On Approach to Scalable Innovation",
    "description": "Discover how AWS PartyRock empowers organizations to transform business workflows and streamline operations using the power of Generative AI. This session will explore innovative strategies for leveraging PartyRock to create AI-driven solutions that automate complex tasks, enhance decision-making, and boost operational efficiency. Through real-world examples, industry-specific use cases, and practical demonstrations, participants will gain actionable insights to deploy scalable solutions, address critical business challenges, and drive impactful innovation in their organizations. Enables Individuals, Teams and Organizations in a faster PoC/Poot and GTM leveraging AWS Partyrock to build quick solutions for customers bringing-in No code interface, Rapid prototyping, Cost-Effective, Enhanced productivity with faster GTM, Customer engagement , Content generation with a plethora of LLMs to choose from with the best accuracy & effectiveness.",
    "speaker_name(s)": "Smita S",
    "time": "Wednesday, November 05, 02:30 PM 03:30 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "The Energy Edge: Optimize Your Health, Elevate Your Career",
    "description": "",
    "speaker_name(s)": "Shannah Van Winkle",
    "time": "Wednesday, November 05, 03:00 PM 03:30 PM",
    "type": "Featured",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "AI & Data: Strategic Assets for Innovation, Privacy, and an Equitable Future",
    "description": "In the digital age, data and artificial intelligence (AI) have become foundational assets—driving innovation, competitive advantage, and social impact. This presentation explores how organizations can unlock the value of data through Responsible AI, while ensuring strong data governance and privacy. Attendees will gain insight into how ethical data practices not only mitigate risk but also build trust, reduce bias, and promote inclusion. We'll dive into real-world examples where AI and data have been leveraged to drive growth and operational efficiency while advancing equity and protecting individual rights. By the end, participants will understand how to approach AI and data strategy in a way that is secure, fair, and future-ready.",
    "speaker_name(s)": "Kai Two Feathers Orton, Kasia Szczerbinski, Jeanette Jordan, Ash Coleman, Hollie King",
    "time": "Wednesday, November 05, 03:30 PM 04:15 PM",
    "type": "Panel",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "A Playbook for Accessible Chatbots and AI Agents",
    "description": "Artificial Intelligence is here and everyone wants to leverage this emerging technology. How can we make sure AI is implemented accessibly? The MITRE Corporation created a playbook with guidance on designing and developing accessible chatbots and AI agents, addressing federal requirements that people with disabilities have access to services and information comparable to those without disabilities.",
    "speaker_name(s)": "Amna Abbas, Jennifer Strickland, Ronna ten Brink",
    "time": "Wednesday, November 05, 03:30 PM 04:15 PM",
    "type": "Panel",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Beyond Binary Thinking: The Power of Interdisciplinary Thinking in Technology Leadership",
    "description": "We all know diversity drives innovation, but diversity of experience is an under-utilized, powerful source of perspectives and thought. This panel assembles a group of leaders who bring non-traditional backgrounds to tech and who are successfully transforming technical problem-solving. In this session, we will explore how their cross-domain expertise helps their teams create more resilient solutions and drive innovation beyond traditional boundaries.",
    "speaker_name(s)": "Arthi Krishna, ToAnh Tran, Kerri-Leigh Grady, Ana Gosseen, Zhamara Reano",
    "time": "Wednesday, November 05, 03:30 PM 04:15 PM",
    "type": "Panel",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Beyond Code: Building AI Products with Ethics, Empathy, and Edge",
    "description": "AI today isn't just about algorithms — it's about the values we encode into systems that touch millions of lives. In this dynamic panel, we gather builders, researchers, and visionaries who are reimagining what it means to create AI with ethics, emotional intelligence, and human impact at the forefront. This session explores the increasingly urgent question: How do we move beyond code — and into care — when building AI systems? With real-world examples from GenAI tools, IoT assistants, and LLM-based interfaces, this panel dissects: How to design for emotional safety and trust in AI How to balance innovation with accountability and consent How edge AI, privacy, and emotional signals intersect in everyday tech Panel invites attendees to challenge industry norms and step into their own power as ethical, empathetic AI leaders.",
    "speaker_name(s)": "tejaswini sirlapu",
    "time": "Wednesday, November 05, 03:30 PM 04:15 PM",
    "type": "Panel",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Black Women Reclaiming Space in Tech",
    "description": "What happens when you're building a career in tech while constantly navigating the feeling of being an outsider? In this powerful and deeply honest panel, Black women in tech, including featured panelist Alexis Williams, share what it truly means to push past exclusion, isolation, and bias to find power, purpose, and community in an industry that often wasn't built with them in mind. Through raw storytelling and lived expertise, this conversation will explore the emotional toll of being \"the only one,\" the coded barriers to entry, and the transformative strategies Black women use to not only survive, but thrive, in tech.",
    "speaker_name(s)": "Alexis Williams, Charlie Jarvis, Awa Sanneh, Mayola Charles",
    "time": "Wednesday, November 05, 03:30 PM 04:15 PM",
    "type": "Panel",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Breaking Barriers: Where Technical Expertise Meets Passion",
    "description": "Join Apple leaders for a dynamic panel discussion to hear how the intersection between passion and technical expertise, has led to breaking barriers. Our panel discussion, aims to foster collaboration, knowledge exchange, professional growth, and inspire technical excellence across various products and services",
    "speaker_name(s)": "",
    "time": "Wednesday, November 05, 03:30 PM 04:15 PM",
    "type": "Sponsored Session",
    "category": "Technology",
    "experience_level": ""
  },
  {
    "session_name": "Breaking Into Tech Product Management, No Matter Where You Start",
    "description": "The technology sector offers exciting opportunities for product managers from traditional industries, but making the transition can be challenging. This panel brings together successful PMs who have navigated the journey from non-technical industries to leading technical products. They'll share their strategies for building technical knowledge, overcoming imposter syndrome, and leveraging their existing product skills in a new context. Our panelists will discuss practical approaches to learning technical concepts, building credibility in a new domain, and using their unique perspectives from traditional industries to drive innovation in tech products. Whether you're actively planning a transition or curious about opportunities in technical product management, this session provides actionable insights and honest discussion about the challenges and rewards of making the switch.",
    "speaker_name(s)": "Archana Raghu, Bhoomika Ghosh, Aditi Agrawal, Kelsy Foulstone, Ana Sofia Rodriguez del Campo Willems",
    "time": "Wednesday, November 05, 03:30 PM 04:15 PM",
    "type": "Panel",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Do you know your numbers? Learn how to build your Financial Acumen as a Woman in Tech",
    "description": "Financial acumen is your ability to see the financial effects and relationships of various aspects of your business. You can grow and increase your revenue and, correspondingly, your career, if you understand the financial aspects of it. The \"why\" for building financial acumen for women in tech is clear, the question this panel attempts to answer is how. The panelists represent a diverse group of women in tech leaders from Northwestern Mutual, U.S. Bank, Chubb, and Geico. The moderator is a woman in tech leader from Northwestern Mutual. Each of the panelists will answer questions elicited by the moderator around their diverse paths and experiences. Their journeys have ranged from taking advantage of opportunities at work to embed themselves with business partners, to maximizing educational resources by gaining a CFP designation, to understanding the details of Total Cost of Ownership (TCO) and Return on Investment (ROI) for their portfolio.",
    "speaker_name(s)": "Anupama Pakala, Ruchi Batra, Uma Morjaria, Keyuri Shah, Neelam Mohanty",
    "time": "Wednesday, November 05, 03:30 PM 04:15 PM",
    "type": "Panel",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Engineering the Backbone: Building the Live Platform Services Behind AAA Games",
    "description": "What does it take to run the invisible infrastructure behind the world's most-played games? In this panel, engineering and product leaders from three of Electronic Arts' foundational platform teams - Marketplace (virtual economies), Social (player connectivity) and Exchange (player-to-player gifting) - come together to explore how they design for scale, empower game teams, and lead through constant change. From supporting 10M-player launches to enabling real-time social systems across genres, panelists will share lessons from the trenches of platform engineering and cross-functional leadership. Each speaker will kick off with a defining insight, followed by a lively discussion on scaling strategy, cross-team alignment, system resilience, and building always-on services that serve billions of operations daily.",
    "speaker_name(s)": "Manu Sharma, Sadaf Rouhani, Maalika Tadinada, Victoria Sykora-Lovaas, Samanwita Pal",
    "time": "Wednesday, November 05, 03:30 PM 04:15 PM",
    "type": "Panel",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "GABI: Gilead's women-led GenAI initiative highlights innovation, collaboration & diversity in pharma",
    "description": "This panel session delves into the journey of a women-led team at Gilead as they spearheaded the development of Gilead Answer Bot with Intelligence (GABI), an internal generative AI application. The initiative entirely conceived and executed internally, represents a milestone in developing a production-ready Gen AI tool within a biopharma setting that sets the standard for innovation, collaboration, and excellence. This session offers an in-depth look at the roles, challenges, and triumphs behind the creation of GABI, featuring the unique perspectives of key contributors and the moderator, Leticia, who brings an external lens as a third-party observer. The panel includes Vaishali (R&D Lead- unstructured data analyses), Angela (R&D Lead- structured data analyses, Lanhui Wang (Production Lead), and Janice (Legal Lead), with Leticia moderating the discussion. Their diverse expertise and roles make for a thought-provoking and dynamic dialogue.",
    "speaker_name(s)": "Vaishali Chaudhuri, Lanhui Wang, Leticia Croffi, Angela Xie, Chitra Narsimhachari",
    "time": "Wednesday, November 05, 03:30 PM 04:15 PM",
    "type": "Panel",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Neurodiversity in Tech - Women's Voices, Lived Experiences",
    "description": "The technology sector is celebrated for innovation, disruption, and pushing boundaries—qualities that often align closely with neurodiverse thinking. It's estimated that 15 to 20% of the global population is neurodivergent; that's one in five people. Yet, despite these numbers and a growing acknowledgment of neurodiversity in the workplace, many neurodivergent individuals—particularly women—face significant challenges in being recognized, understood, and supported. The lived experiences of neurodiverse professionals—particularly women—remain underrepresented in conversations around inclusion and equity. This panel brings together four neurodiverse women in technology who will share their candid stories, professional journeys, and the systemic challenges they've encountered and overcome.",
    "speaker_name(s)": "Preethi Parthasarathy, Allison Baker, April Lebahn, Jennifer Schachter, Rose Shuman",
    "time": "Wednesday, November 05, 03:30 PM 04:15 PM",
    "type": "Panel",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Technical Enough:How Humanities Majors Are Leading Tech'f3And What Engineers Need to Learn Beyond Code",
    "description": "This panel reclaims the \"not technical enough\" narrative directed at humanities majors, typically framed as a limitation or pivot, and reframes it as a strategic advantage to actively cultivate in today's tech landscape. With 75% of employers saying soft skills are as or more important than technical skills—and as AI demands more ethical, user-centered, and systems-thinking approaches—this conversation is urgent. Our panelists, all tech leaders with humanities roots, will explore how storytelling, critical thinking, research, and cultural fluency have uniquely positioned them to drive innovation in GenAI, advertising, and consumer products—and to lead in high-impact technical environments. We'll challenge the \"technical vs. non-technical\" binary, showing that deep expertise takes many forms—and that today's most impactful technologists often blur those lines. This session also invites engineers to expand their leadership toolkit by embracing the human skills that supercharge growth.",
    "speaker_name(s)": "Susan Westwater, Anna Jeon, Kristen Petrenko, Trishala Pillai",
    "time": "Wednesday, November 05, 03:30 PM 04:15 PM",
    "type": "Panel",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "The Future of Women's Health: Research, Technology, and Equity",
    "description": "Women's health has historically been underfunded, under-researched, and underserved—but a transformative shift is underway. This session explores the cutting-edge innovations, emerging research paradigms, and equity-focused initiatives reshaping women's healthcare for the better. The conversation will spotlight critical research gaps being addressed by the next generation of scientists including studies on conditions that predominantly affect women, the impact of hormonal cycles on disease progression, and long-neglected areas like postpartum health and perimenopause. We'll also discuss how inclusive clinical trials and diverse research cohorts are finally centering the experiences of women across different races, ethnicities, socioeconomic backgrounds, and gender identities.",
    "speaker_name(s)": "Shannah Van Winkle, Brittany Barreto, PhD, Jennifer Hintzsche, Oluwateniola Brown, MD",
    "time": "Wednesday, November 05, 03:30 PM 04:00 PM",
    "type": "Featured",
    "category": "",
    "experience_level": ""
  },
  {
    "session_name": "Unbound with AI: How Tech Leaders leverage GenAI to Thrive at Work- and in Life",
    "description": "Gen AI isn't just transforming how we work, it's redefining how we live. But how do we harness it not just for productivity, but for navigating a life of balance and purpose? In this dynamic, cross-industry panel, a Senior Enterprise Engineer at AWS, a Senior Product Manager at Oracle, and a Senior Data Scientist at Microsoft share how they use GenAI to streamline workflows, fuel creativity, and support holistic well-being. From drafting performance reviews and building personal brands to planning vacations, tracking physical and mental wellness goals, and automating content creation segments, discover how GenAI fuels their 9-to-5 and 5-to-life! You'll gain practical insights into no and low-cost AI tools, prompting tips, and exclusive access to a fine-tuned GPT designed by the three panelists for GHC attendees to navigate a well-balanced life. Their diverse roles and life stages ensure a lively, actionable conversation on how to harness GenAI for both professional & personal growth.",
    "speaker_name(s)": "Andrea Peng, Smriti Singh, Lily Wong, Ramu Murakami Gutierrez",
    "time": "Wednesday, November 05, 03:30 PM 04:15 PM",
    "type": "Panel",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Vibe Coding for Leaders",
    "description": "Join Wall Street Journal bestselling author Gene Kim and AI coding pioneer Steve Yegge for an interactive session on the future of software development. Drawing from their upcoming book Vibe Coding, they'll share how AI is transforming how we build, collaborate, and innovate. Learn practical ways to work with AI coding tools, adapt engineering practices, and embrace new levels of speed, creativity, and autonomy in your teams.",
    "speaker_name(s)": "Gene Kim, Steven Yegge",
    "time": "Wednesday, November 05, 03:30 PM 05:00 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": ""
  },
  {
    "session_name": "Women Driving Innovation in Autonomous Tech: Shaping the Future of Mobility",
    "description": "This session brings together female leaders in autonomous vehicle (AV) development and deployment to discuss their role in transforming transportation. The panel aims to highlight the contributions of women driving innovation, address challenges in tech leadership, and explore how inclusive teams shape better, more ethical AV solutions.",
    "speaker_name(s)": "Erin Perez",
    "time": "Wednesday, November 05, 03:30 PM 04:15 PM",
    "type": "Panel",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Your PM Career Playbook Is Outdated'f3Thanks to AI. Here'eds the Rewrite",
    "description": "How do you grow a career in roles that AI threatens to automate, or radically transform? As AI reshapes the tech industry, Product and Technical Program Managers find themselves at pivotal crossroads. Join four AI PMs and TPMs from Microsoft, ranging from early in career to principal level, as they discuss how career growth is evolving in this new era. From practical strategies to philosophical shifts, each panelist offers a unique lens into how we can reinvent and thrive, not just survive, in the new AI era.",
    "speaker_name(s)": "Suvarna Saraswat, Jayda El Hakie, Miti Joshi, Christa Simaan, Shreya Singh",
    "time": "Wednesday, November 05, 03:30 PM 04:15 PM",
    "type": "Panel",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "(Ay)I Glowed Up: How Women of Color Can Use AI Agents to Build the Lives of Their Dreams",
    "description": "Session Description AI isn't just for coders anymore—and it's time women of color led the next era of automation. This interactive workshop introduces an AI agent, CHATty GuPTa, who explores how intelligent assistants can support branding, strategy, and vision implementation for modern creators and founders. While this session centers the needs and experiences of women of color—who are too often excluded from emerging tech spaces—it is open to all attendees interested in building ethical, intuitive, and personalized AI tools. We'll break down prompting frameworks, values-aligned design, and no-code automation strategies to help participants begin mapping how AI can be used as sacred, strategic tool to build with clarity, power, and purpose. Presenter Bio Kela X. Harris is a seasoned IT professional, AI educator, and Navy veteran who founded SUPANOVAS AI—a spiritual-tech platform designed to help women of color lead in AI, automation, and digital transformation.",
    "speaker_name(s)": "Kela Harris, Eriehl Wilson",
    "time": "Wednesday, November 05, 04:00 PM 05:00 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Help! What Kind of Dev Do I Want to be?",
    "description": "",
    "speaker_name(s)": "Mandy Meindersma, Jasmine Woo, Helen Gezahegn",
    "time": "Wednesday, November 05, 04:00 PM 05:00 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Model Context Protocol (MCP): The Next Frontier of Generative AI",
    "description": "As generative AI moves from experimentation to enterprise-scale adoption, the need for structure, control, and context becomes critical. Enter the Model Context Protocol (MCP)—a new paradigm that standardizes how applications communicate with foundation models using modular, context-rich instructions. MCP enables safer, more interpretable, and reusable GenAI workflows by separating business logic from prompts and embedding policy and governance into interactions. This session will explore how MCP is reshaping the GenAI application stack, empowering developers to build scalable, secure, and human-aligned AI systems.",
    "speaker_name(s)": "Nafi Diallo, Neelam Koshiya",
    "time": "Wednesday, November 05, 04:00 PM 05:00 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Tell your Story: Resume Building Workshop",
    "description": "This workshop aims to offer practical resume improvement experience. Drawing on our experiences as students, interns, graduate teaching assistants and now as software engineers/mentors, we will share our insights on resume formatting, structure, and project descriptions. The session will be hands-on, with examples and general guidance provided to facilitate immediate improvements. Attendees will be encouraged to apply these suggestions to their own resumes during the workshop. The primary goal is for participants to acquire general resume-building knowledge and begin implementing it right away. This workshop is designed for tech students and early career professionals.",
    "speaker_name(s)": "Sowjanya Vemuri, Nikitha Gollamudi",
    "time": "Wednesday, November 05, 04:00 PM 05:00 PM",
    "type": "Workshop",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Connecting Machine Learning and Materials Science at 3M",
    "description": "3M applies science in collaborative ways to improve lives daily; and a career in its corporate R&D has offered a multitude of opportunities to connect 3M's core technologies, such as adhesives, nonwovens, and optical films, with machine learning to create new solutions for display devices, anti-counterfeiting, optical metamaterials, and beyond. This session will showcase examples of combining material and digital technologies, while highlighting themes of key considerations for applied science, human intelligence and artificial intelligence, and what remains to be discovered in machine learning for materials science.",
    "speaker_name(s)": "Jennifer Schumacher",
    "time": "Wednesday, November 05, 04:30 PM 05:15 PM",
    "type": "Sponsored Session",
    "category": "Technology",
    "experience_level": ""
  },
  {
    "session_name": "AI Fluency for Every Function: Skills That Drive Adoption",
    "description": "",
    "speaker_name(s)": "Ashley Masters Hall",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Building Trustworthy AI Products: A Cross-Functional Perspective from Product, Science, UX, and Engineering Stakeholders",
    "description": "",
    "speaker_name(s)": "Kelsy Foulstone, Shreya Chakrabarti, Aditi Asthana, Suganya Nagarajan, Lauren Paul",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Panel",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Building Your Professional Story: Creating an Executive Portfolio That Opens Doors",
    "description": "In today's competitive tech landscape, effectively communicating your professional journey is crucial for career advancement. This session provides a practical framework for creating a comprehensive executive portfolio, using my journey from tech support to AWS Senior Specialty Account Executive as a case study. Drawing from experience that secured speaking opportunities at major tech conferences and leadership roles at IBM, Cisco, and AWS, I'll share strategies for structuring your professional story, quantifying achievements, incorporating personal brand differentiators, and creating impactful visual elements. Attendees will receive templates and actionable steps to create their own powerful executive portfolio, particularly valuable for mid-career technologists advancing to senior leadership positions or increasing industry visibility through speaking engagements.",
    "speaker_name(s)": "Antoinette Mills",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "COBOL in the Modern World: Why This Legacy Language Still Matters",
    "description": "COBOL(Common Business-Oriented Language), one of the earliest programming languages, still quietly powers critical systems in finance, government, and healthcare. Yet as experienced developers retire, we face a serious talent gap that could jeopardize these foundational infrastructures. This session introduces COBOL in a modern context—no prior experience needed. Attendees will learn to read and write basic COBOL, understand its role in today's tech ecosystem, and explore how to modernize legacy systems responsibly. This session is a tribute to Grace Hopper's groundbreaking work and a call to action for the next generation to sustain and evolve her legacy—by stepping into a space where they're urgently needed.",
    "speaker_name(s)": "Angel Han",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "CVS Health: Transforming Consumer Health Care Experience Through Technology",
    "description": "In today's fragmented health care landscape, consumers expect simplicity, personalization, and seamless access to care. This breakout session explores how CVS Health is bringing together Artificial Intelligence, digital innovation and human-centered care to reimagine the experience of Aetna members and CVS Pharmacy customers. Join us to learn how we are empowering consumers to navigate their health journeys with confidence and making it simple to access the care they need when they need it.",
    "speaker_name(s)": "Laure Salomon",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Sponsored Session",
    "category": "Technology",
    "experience_level": ""
  },
  {
    "session_name": "GenAI Productivity & Proficiency for Technologists",
    "description": "Discover how GenAI is transforming everyday workflows and supercharging productivity across roles. This session explores practical, high-impact use cases that resonate with a broad employee base— automating documentation, summarizing meetings, and enhancing communication. We'll then dive deeper into advanced applications tailored for technologists, including test code generation, design ideation, and product prototyping. Whether you're a developer, product designer, or tech leader, you'll leave with actionable insights and tools to boost your GenAI proficiency and drive innovation in your teams.",
    "speaker_name(s)": "Sirisha Garapati, Meg Roughen",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Hands-On Threat Modeling: A Practical Workshop to Secure Your Product",
    "description": "Shift from reactive security to proactive defense in this hands-on threat modeling workshop. You won't just hear about threat modeling; you'll do it. We'll guide you step-by-step through deconstructing a system, identifying potential threats, documenting your findings, and brainstorming effective mitigations. Learn a practical, repeatable process based on real-world application, empowering you to uncover vulnerabilities before attackers do. Walk away with the skills and confidence to implement threat modeling for your own products, fostering a stronger security posture. Ideal for engineers, architects, and PMs who want to build more secure software through practical application.",
    "speaker_name(s)": "Adam Darcy, Deeheem Ansari",
    "time": "Thursday, November 06, 09:00 AM 10:00 AM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "How to Craft a Winning Career Narrative That Sticks, Speaks, and Sells in a World of Constant Change",
    "description": "In a world of AI disruption, evolving tech stacks, and constant reinvention, the professionals who stand out aren't just the most skilled—they're the most story-ready. We remember people by their stories, not their resumes. So, how do you craft a career narrative that not only gets you hired, but also makes people remember, advocate for, and believe in you? In this tactical, hands-on session, technologist and storyteller Trishala Pillai walks you through a career-mapping framework designed to help you extract the patterns, lessons, and power of your unique professional journey—using the psychology of how humans process and remember information. You'll learn how to reverse-engineer job descriptions, identify narrative patterns in your timeline, and create versions of your story for interviews, networking, and everyday career conversations.",
    "speaker_name(s)": "Trishala Pillai",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Internship Chronicles: Level Up Every Internship from Day One",
    "description": "Ever wrapped up an internship wondering, \"Did that even count?\" Join two recent grads—one who interned at Apple, one at Uber—as we spill the secrets to turning every co-op/internship stint into a launchpad for your career. You'll discover how to: Set Expectations Early: Craft clear goals with your mentor so you know exactly what success looks like. Earn Stretch Assignments: The art of volunteering for high-impact tasks without overpromising. Document Your Wins: Build a living \"artifact vault\" (diagrams, code snippets, test results) that showcases impact Bullet-Proof Resume: Transform those deliverables into compelling, metrics-driven bullets that recruiters can't ignore. Reflect & Showcase: Use a simple journaling framework and end-of-term demo to maximize learning—and visibility. Whether you're a first-time intern or lining up your next co-op, this interactive workshop will equip you with a repeatable playbook and elevate your post-grad opportunities.",
    "speaker_name(s)": "Atandrila Anuva",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Jeepers! Why isn't Agile working for our team?",
    "description": "The Mystery Machine gang each have their own unique quirks and responsibilities '96 just like an Agile team! This presentation will help you unmask the mystery of how behavioral patterns can impact the whole team and how to remedy them to get back on track. We'll talk about the Agile team structure (in terms of the Scooby Squad) and their individual responsibilities for some context before diving into how they could be inadvertently preventing the team's success. In true problem-solving fashion, we'll uncover the root cause of each behavior and how to avoid it in the future. No need to say \"ru-roh,\" this presentation will help the whole team work together better.",
    "speaker_name(s)": "Meghan Flynn, Gyovanni Boston-Crompton",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Leveling the Playing Field: Fair Scoring and Inclusion in Tech & Education",
    "description": "Standardized exams like the GRE or SAT often run in different sessions, each with varying question difficulty, raising fairness concerns. This research introduces a statistical method to adjust scores based on test difficulty. By calculating a difficulty index for each test version—based on participant performance—we apply a correction factor to adjust raw scores. Simulations show that this method produces more balanced, equitable results than traditional scoring, leveling the field for all test-takers. The approach is practical, scalable, and ensures fairness regardless of exam slot. This method can also be extended to academic grading, where course difficulty varies. For example, two students scoring 85% in different subjects—one in advanced physics, the other in an easier elective—would be evaluated more fairly by accounting for difficulty. This research supports a more just system in both standardized testing and academic assessment.",
    "speaker_name(s)": "Saranya S",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Mastering Prompt Engineering: Use ChatGPT as an Analyst",
    "description": "This session dives into prompt engineering — the new literacy for working with large language models (LLMs). Learn how to shape AI responses to extract insights, automate tasks, and generate structured output. We'll explore real-world use cases, from research and content creation to data analysis. You'll gain practical strategies like role-based prompts, prompt chaining, and troubleshooting techniques to make ChatGPT a powerful tool in your workflow.",
    "speaker_name(s)": "Sri Harshitha Gollamudi, Satya Bhargavi, Satya Chandana Snehal Mattaparti",
    "time": "Thursday, November 06, 09:00 AM 10:00 AM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "NEXT-Level Leadership: A Fireside Chat with Rebecca Parsons & Ashley Johnson",
    "description": "Join Rebecca Parsons and Ashley Johnson for a candid fireside chat on their rise to the C-suite and board leadership. This capstone session wraps up our masterclass series and offers a glimpse into the kind of executive growth explored in the NEXT program.",
    "speaker_name(s)": "Rebecca Parsons, Jeanette Jordan, Ashley Johnson",
    "time": "Thursday, November 06, 09:00 AM 10:30 AM",
    "type": "Panel",
    "category": "Senior to C-Suite",
    "experience_level": ""
  },
  {
    "session_name": "Observability for DevOps Success in Cloud-Native Systems",
    "description": "In cloud-native systems, observability is more than monitoring. This session explores how metrics, logs, traces, and events empower teams to detect issues, investigate incidents, and secure containerized environments, including Kubernetes. This session is ideal for DevOps engineers or SREs, looking to enhance visibility and stability in their DevOps pipelines and/or Kubernetes cluster while also growing their cloud skillset. Through real-world examples and dashboards from Oracle Cloud Infrastructure (OCI), attendees will gain practical skills and insights to build secure, resilient, and automated systems using observability as a core DevOps capability.",
    "speaker_name(s)": "Khushboo Nigam",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Recharge Your Energy to Fuel Your Productivity",
    "description": "In both our personal and professional lives, we're often juggling competing priorities, tight deadlines, and nonstop demands. With so much on our plates, it's easy to fall into a pattern of running at full speed for long stretches without pausing to rest or reflect. While this may feel productive in the short term, over time it leads to stress, exhaustion, and ultimately burnout. To maintain our mental health and overall well-being, it's essential to find ways to regularly recharge our batteries. This is easier said than done. Recharging doesn't look the same for everyone; what restores one person may not work for another. Likewise, the signs that we're nearing depletion can vary widely from person to person. Join us to: Understand the connection between stress, energy, and overall well-being Explore your personal relationship with stress and identify your early warning signs Learn simple, realistic strategies to recharge, especially when time is limited",
    "speaker_name(s)": "Marissa Duarte, Christine Lam",
    "time": "Thursday, November 06, 09:00 AM 10:00 AM",
    "type": "Workshop",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Redesigning the Tech Talent Pipeline",
    "description": "Join Linda Calvin, Western Governors University's School of Technology vice president and dean for the department of cybersecurity, cloud and IT, for a discussion of the talent gap, importance of education in tech-related fields, the scorecard for diversity, and how companies can rethink talent pipeline development to meet gap needs for emerging tech. Former chief impact officer for Reboot Representation and founder of Indiana Women IN Tech Week, Linda will also outline the importance of women staying the course and finding a mentor to progress in tech fields.",
    "speaker_name(s)": "Linda Calvin, Megan Stevens",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Sponsored Session",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Responsible AI and Human Capital: What Every Leader Needs to Know",
    "description": "AI-enabled human capital tools are all the rage. Promising faster results with fewer resources, employers are rapidly adopting AI-integrated human capital tools, such as resume sorters and AI-enabled note-taking, at a rapid pace. But have business leaders really considered what they're getting with these shiny new AI-tools? Research shows that most AI models not only replicate but exacerbate existing social biases along racial, gender, and age lines. Without thoughtful consideration, companies may be introducing a new layer of machine-enabled discrimination into their people processes by incorporating AI tools into their human capital strategy. This session seeks to clarify what business leaders need to consider when adopting AI human capital tools and offer solutions to debias and derisk systems.",
    "speaker_name(s)": "Bo Young Lee",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Shield Up: Building Unbreakable AWS Infrastructure Against DDoS Attacks",
    "description": "Imagine your AWS infrastructure as a fortress '96 but what happens when it faces a tsunami of malicious traffic? This session reveals the battle-tested blueprint for defending your cloud against DDoS attacks. We'll demonstrate how to build an ironclad defense system by combining AWS Shield's automatic protection with Web Application Firewall's smart filtering, all while leveraging CloudFront's global edge network. You'll learn how to architect your infrastructure to absorb and deflect attacks through strategic use of Auto Scaling, multi-region deployment, and intelligent load balancing. Whether you're facing volumetric floods, protocol exploits, or sophisticated application-layer attacks, you'll walk away with practical, immediately applicable strategies to protect your AWS environment. Perfect for security engineers, and DevOps professionals who want to sleep better at night knowing their infrastructure is secure against the internet's biggest threat.",
    "speaker_name(s)": "jyothsna yarlagadda",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Starting Your Own Culture Team: Empowering Others to Make an Impact",
    "description": "Building a strong, inclusive workplace culture doesn't happen overnight, it takes intention, persistence, and people who care. In this session, I'll share my 5+ year journey of launching and growing a culture team at Microsoft. From gaining leadership support to organizing meaningful initiatives, I'll Walk through the wins, the lessons, and the challenges of driving cultural change from within.",
    "speaker_name(s)": "Elizabeth Alume",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "The Power of the Pause: Living with Intention in Hustle Culture",
    "description": "In a world that celebrates speed, output, and perpetual motion, hitting \"pause\" can feel like failure. But what if stepping back is actually the most powerful move you can make?",
    "speaker_name(s)": "Jun Ong",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Unleashing Superpowers: Designing for Equity, Agency & Innovation in Tech",
    "description": "We are living in a time of extraordinary disruption—and possibility. As AI, automation, and digital systems evolve, so must our approach to leadership, inclusion, and innovation. But what if the greatest source of transformation isn't technology itself—but the people shaping it? This session introduces a strengths-based Superpower Framework that reimagines leadership through the lens of identity, lived experience, and personal resilience. Participants will discover their unique \"superpowers\"—like empathy, pattern recognition, curiosity, and problem-solving—and learn how to activate them in tech spaces. Through interactive reflection, visual mapping, and a guided self-assessment, attendees will explore how to identify their strengths, build inclusive teams, and lead with authenticity. This session offers a fresh lens on power and purpose—designed to affirm diverse experiences and redefine what it means to thrive in tech.",
    "speaker_name(s)": "Gina Grant",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "What Were They Thinking? A Journey Through Decision Making with ADRs",
    "description": "Have you ever gone back to review your code from six months ago and wondered \"what was I thinking\"? One of the hardest things to track during a project is the motivation behind why certain decisions were made. This leads to future developers either blindly accepting or rejecting previous decisions. Through this workshop, you can learn a process to document design decisions in an efficient, structured manner using Architecture Design Records (ADRs). In this workshop, participants will learn about a position management system and work through making system design changes to it. As in a real workplace, requirements will change over time. We will navigate this by referring back to the initial ADR and making necessary changes to subsequent ADR versions. This workshop is intended for early and mid-career engineers. Through it, engineers will learn how to increase transparency of decisions, maintain architectural consistency, and make better informed architectural decisions.",
    "speaker_name(s)": "Navya Shree Nagendra Rao, Tanvi Haldankar",
    "time": "Thursday, November 06, 09:00 AM 10:00 AM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Why talking about female health made us better at work - a deep dive into navigating the 3Ms",
    "description": "After a successful series of open discussions in person and online about Menstruation, Motherhood and Menopause, we have put together a formal talk for a wider audience. The talk will include our personal stories of women's health - focusing on fertility, loss and menopause against the backdrop of being women in a male dominated tech world. How it might feel to flood out during a meeting, to be supporting direct reports whilst you are going through fertility treatment or worrying about being judged because you have a hot flush in the office are all common female health themes that many of us have experienced. How women can support each other to have the right conversations at the right time with their male counterparts, and how to prioritise self care will be covered as key topics. We will cover how we have navigated difficult personal issues whilst driving careers and how we have intentionally gone about creating supportive working networks will be a key focus area.",
    "speaker_name(s)": "Sophie Hogarth, Kajal Bansal",
    "time": "Thursday, November 06, 09:00 AM 09:45 AM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "A case for going out of your comfort zone",
    "description": "This talk chronicles a transformative journey from the familiar landscape of software architecture to the dynamic realm of cloud security at Uber. Discover how the courage to step outside a well-defined comfort zone, coupled with Uber's commitment to diverse talent, continuous learning, and innovative thinking, fueled this exciting career transition. Beyond the professional growth, this session will explore the profound personal benefits of embracing discomfort, including increased risk-taking aptitude, enhanced self-confidence, and a strengthened belief in one's ability to master new skills. Learn how Uber's supportive environment empowered this unconventional career path and how the lessons learned extend far beyond the technical domain, offering valuable insights for anyone seeking personal and professional expansion.",
    "speaker_name(s)": "Sonal Desai",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Balancing Code and Coursework: Thriving in a Full-Time Job While Earning a Degree",
    "description": "In today's fast-moving tech industry, continued education is key to growth—whether you're stepping into leadership, shifting domains, or reigniting curiosity. But how do you balance a graduate or PhD program while working full-time? In this session, I'll share my experience as a software engineer at Amazon pursuing a hybrid Master's in Engineering Management. From late-night assignments to finding time for rest and relationships, I'll walk through real challenges and practical strategies that helped me stay grounded. This talk challenges the notion that women in tech must choose between career and education. It's a call to go Unbound—beyond timelines, perfectionism, or single definitions of success. Attendees will leave with mindset shifts, time-tested tools, and a flexible roadmap to thrive on this ambitious dual path.",
    "speaker_name(s)": "Roline Stapny Saldanha",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Creating Calm in the Chaos: Strategies for Better Collaboration",
    "description": "In fast-paced product teams, chaos often feels unavoidable—misaligned roadmaps, async overload, clashing personalities, and shifting priorities. This session shares real-world rituals, frameworks, and inclusive practices we've used to bring clarity, trust, and cohesion to global product teams at scale. You'll learn how to design async critiques, use North Star documents for alignment, and run inclusive design jams that honor different voices—introverts, early-career members, and senior leaders alike. We'll share metrics from teams where meeting time dropped 35% and delivery improved by 26%, thanks to intentional collaboration. Whether you're a PM, designer, or team lead, walk away with practical templates and strategies to create psychological safety, boost team clarity, and drive product outcomes—without burning out.",
    "speaker_name(s)": "Antara Dave, Shalini Dinesh",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Designing for humans in an AI-native future",
    "description": "We are entering a new age of exploration, where AI agents will not just assist us—they will act on our behalf, making purchasing decisions and navigating the digital world for us. This new reality doesn't change fundamental human needs; it sharpens their importance. Whether you're in design, product, or engineering, your greatest value will be your ability to direct AI to solve strategic problems, freeing you up to focus on creativity, empathy, and leadership. Join me to explore our playbook for winning in an AI-native world by transforming our industry, empowering our workforce, and designing radically new customer experiences.",
    "speaker_name(s)": "Arundhati Singh",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Sponsored Session",
    "category": "",
    "experience_level": ""
  },
  {
    "session_name": "Engineering in the Age of Gen-AI: Redefining Roles, Skills, and Leadership",
    "description": "As generative AI and automation reshape the software landscape, engineering is undergoing a profound identity shift. The future will not just belong to those who write code—but to those who understand how to apply, adapt, and lead with it. This session explores how Gen-AI is changing the very nature of engineering work—and what today's leaders must do to prepare their teams for what's next. Key topics include: Code as leverage, not just output: Why future-ready engineers will be defined by problem-solving, systems thinking, and product fluency. The rise of the engineering curator: How AI copilots shift focus from writing code to designing and validating the right solutions. New leadership responsibilities: Guiding teams through uncertainty, driving upskilling, and fostering ethical literacy around AI use. Reimagining team roles: What automation means for junior developers, QA, SRE, and the full software lifecycle.",
    "speaker_name(s)": "Sreedevi Mohan",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "From Instability to Insight: Modeling Geopolitical Risk",
    "description": "In an era where headlines shift markets and global tensions drive business strategy, understanding geopolitical risk is no longer optional '96 it is essential. But how do we move beyond gut instinct and expert opinion? This session will dive into the cutting-edge world of data modeling for geopolitical risk analysis. It will look at ways in which we are leveraging quantitative tools to transform how we forecast conflict, assess instability and navigate an ever more volatile world.",
    "speaker_name(s)": "Danielle Murad Waiss",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "From Reactive to Agentic: Real-World Enterprise AI Case Studies in Cybersecurity",
    "description": "The rise of large language models has ushered in the age of agentic AI—systems that can reason, plan, and take action using tools. In this session, you'll learn how these systems are transforming NVIDIA cybersecurity operations through two real-world use cases: automated server alert triage and software vulnerability analysis. We'll explore how agents reduce the human toil of reacting to alerts and vulnerabilities by conducting investigations, analyzing data, and generating structured reports. Along the way, you'll learn how to choose the right system architecture for the job, from fixed paths to fully adaptive agents, and why hybrid designs often strike the best balance. We'll also share lessons from the field: the importance of designing with users in mind, defining success early, and starting simple with quick iterations. Whether you're in cybersecurity or any other field, you'll leave with practical insights and fresh inspiration to bring agentic AI to life in your own work!",
    "speaker_name(s)": "Ashley Song, Hsin Chen",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "From Rejection to Realization: How Failure Landed Me My Dream Job at Disney",
    "description": "Failure isn't the end — sometimes, it's the beginning. In this talk, I'll share my messy, very human journey from academic probation and job rejections to becoming a recruiter at The Walt Disney Company. From moving states and losing my dad to flunking out and burning out, I'll unpack the moments that nearly broke me — and the lessons that helped me rebuild. Through humor, honesty, and heart, this session reframes failure as fuel. Whether you're pivoting careers, feeling stuck, or navigating rejection, consider this a love letter to late bloomers, comeback stories, and the unexpected paths that still lead to dream jobs. Tattoos, ghost blouses, breakdowns — all welcome. Key Takeaways: Reframe rejection as redirection Tools to bounce back from setbacks with purpose How vulnerability can elevate your tech career Proof that nonlinear paths still lead to success",
    "speaker_name(s)": "Victoria Garner",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "From Serving Tables to Serving Users: The Path to Product Management",
    "description": "From serving tables at my parents' 12-table restaurant—where I crafted makeshift chopsticks so a little guest could proudly join her family's meal, and redesigned our clunky website using insights gathered through casual conversations with customers scrolling our menu on their phones to place to-go orders—to researching real estate markets, and now shipping products at Microsoft, I discovered product management isn't about a CS degree or \"PM\" in your title. It's a mindset rooted deeply in empathy, honed through every interaction. Each rubber-banded chopstick taught me to anticipate unspoken needs; each website tweak fueled scrappy innovation grounded on customer feedback; each real market analysis sharpened my ability to align stakeholders and make data-driven decisions. You'll leave with a practical guide to spot, refine, and showcase your transferable skills—and proof that anyone who's solved customer problems through empathy can thrive in product management.",
    "speaker_name(s)": "Karen Guo",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Governance Meets Code: Operationalizing Ethics in AI Use Cases",
    "description": "In this engaging session, we'll explore the evolving landscape of ethical considerations in Generative AI and how these principles are being actively applied within Experian. Tailored for technology leaders and professionals, this session explores key ethical challenges: bias, transparency, accountability, and data privacy, and how Experian addresses them in practice. We will showcase real use cases and a prototype demo, revealing how Experian embeds ethical principles into AI solutions like credit risk modeling and customer engagement. Key Takeaways: '95tCore ethical principles in GenAI '95tExperian's approach to responsible AI '95tReal-world applications and outcomes '95tPrototype demo of ethical AI in action '95tFrameworks for ethical AI adoption Whether you're a C-suite executive, a technology leader, or a culture champion, this session will equip you with insights and frameworks to navigate the intersection of AI innovation and ethical responsibility.",
    "speaker_name(s)": "Marizette Galvez, Marivi Stuchinsky",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Green Pods: Architecting Sustainable and Responsible Kubernetes Solutions for a Better Tomorrow",
    "description": "",
    "speaker_name(s)": "Antoinette Mills, Rachel Leekin",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Rigorous Qualitative Human-Centered Methods for CHIPS & Science Act Broadening Participation Mandate",
    "description": "This talk will explore how to meet requirements of 2022's CHIPS (Creating Helpful Incentives to Produce Semiconductors) and Science Act. There is a need to \"ensure collaboration and coordination across federal agencies, the private sector, and with state and local governments to facilitate timely and effective reviews of all federally-funded projects.\" One mandate includes \"measures of the institution's ability to attract and retain a diverse and nontraditional student population in the fields of science, technology, engineering, and mathematics, which may include the ability to attract women, minorities, and individuals with disabilities.\" This criterion is needed by organizations that hire and wish to retain graduates enabled by this act. This public policy evolution of Indi Young's listening sessions methodology adapts a rigorous method to include aspects relevant to public sector work. Those working in both the public and private sectors will find this methodology useful.",
    "speaker_name(s)": "Jennifer Strickland",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Securing the SaaS Supply Chain: A Practical Approach",
    "description": "",
    "speaker_name(s)": "Raja Rajeswari U",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Stopping Bad Actors: How Tech Tackles Fraud and Abuse at Scale",
    "description": "In an era where digital platforms underpin everything from financial transactions to social engagement, fraud and abuse have emerged as sophisticated, fast-evolving threats. This session explores the real-world impact of fraud and abuse in digital ecosystems and outlines cutting-edge strategies to detect, mitigate, and prevent these threats. Attendees will learn how companies are leveraging behavioral analytics, machine learning, and proactive security design to stay ahead of bad actors—while ensuring that their approaches meet increasingly stringent compliance and data protection standards. We'll showcase practical techniques for identifying risky behaviors, enforcing security at the API layer, and maintaining the delicate balance between user experience and safety. This session is a must-attend for security professionals, compliance leaders, engineers and product teams looking to strengthen their fraud prevention strategies while preserving trust and regulatory alignment.",
    "speaker_name(s)": "Spoorthy Balasubrahmanya",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Switch, Rest, Succeed: A Tech Guide to Thriving After Career Change",
    "description": "Career changes promise fresh starts—but they don't erase burnout, insecurity, or the grief of leaving a field you once loved. After years at the lab bench, I jumped from immunology research to machine-learning engineering, convinced a brand-new domain would fix everything. Instead, I met a perfect storm of imposter syndrome, perfectionism, and 24/7 worry—until therapy and deliberate self-care taught me that productivity without rest is unsustainable. In this candid, fast-paced talk, I unpack the hidden emotional costs of \"reinvention,\" reveal how painful detours can become superpowers, and share science-backed habits that help brains (and careers) flourish. You'll leave knowing no time is wasted, every skill is transferable, and mental health is the real performance upgrade.",
    "speaker_name(s)": "Qianru Wei",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "",
    "description": "This session explores the raw and real experience of navigating early motherhood while working in tech—especially as a remote employee during a return-to-office era. Through personal stories and actionable strategies, attendees will learn how to stay visible, maintain performance, and protect their well-being in a system that often overlooks caregivers. Perfect for working moms, allies, and leaders committed to inclusion and retention in STEM.",
    "speaker_name(s)": "Binal Kamani",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Usable Security 'f3 Bridging Research and Industry Practice",
    "description": "Security is only as effective as its usability. Yet, designing security features that users can understand, trust, and properly engage with remains a persistent challenge. This talk dives into the principles of usable security — the intersection of human-computer interaction and security — and how these principles translate from academic research into real-world product development. Drawing on her Ph.D. research and over a decade of industry experience at Google and Snowflake, Iulia Ion will guide attendees through the core tenets of usable security, including user-centered design, transparency, minimal user burden, and contextual trust. Iulia will discuss the practical realities of applying usable security principles within fast-paced engineering organizations. This session is ideal for software engineers, security practitioners, product managers, and UX designers interested in designing secure systems that users can actually use effectively.",
    "speaker_name(s)": "Iulia Ion",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Women in Tech: Shaping the Future of Financial Well-Being",
    "description": "",
    "speaker_name(s)": "Celia Karam",
    "time": "Thursday, November 06, 10:15 AM 11:00 AM",
    "type": "Sponsored Session",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Life's Too Short for Mundane Tasks: Let LLM Agents Revolutionize Your Processes",
    "description": "As AI becomes increasingly integral to software development, the need for dynamic, intelligent process automation is growing. Traditional orchestration tools fall short when workflows require reasoning and adaptation. LangGraph is an open-source framework that extends LangChain to build stateful, multi-agent systems powered by language models. In this hands-on workshop, we explore how LangGraph empowers developers to create language-model based workflows using a graph structure. We will demonstrate how LangGraph simplifies the orchestration of autonomous agents, handles branching logic and memory, and enables coordination across tasks such as document processing, decision-making, and human-in-the-loop review. Participants will learn to build, debug, and evaluate agentic applications using LangGraph. We'll explore defining custom agents, managing flow control through graph edges, and handling state transitions where human input, model reasoning, and external tools intersect.",
    "speaker_name(s)": "Anagha Rumade, Apoorva Jaiswal, Anjana Umapathy",
    "time": "Thursday, November 06, 10:30 AM 11:30 AM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Modeling a GraphQL service on AWS: A Hands-on Workshop",
    "description": "This presentation will focus on demonstrating GraphQL capabilities through a small-scale proof of concept using AWS AppSync. The session will showcase fundamental GraphQL operations, including query and mutation implementations, along with real-time notification features. The demonstration will utilize AppSync as the GraphQL service layer, with Lambda functions handling the business logic. For messaging and notifications, the architecture will incorporate SQS and SNS, while DynamoDB will serve as the persistent data store. Designed to be beginner-friendly, this workshop will help attendees familiarize themselves with AWS concepts while learning practical GraphQL implementation strategies. Participants will learn how GraphQL can simplify data access across multiple facets and datasets, using a real-world pricing domain example that demonstrates how to streamline complex data management scenarios.",
    "speaker_name(s)": "Nisha Aggarwal, Aishwarya Tirumala",
    "time": "Thursday, November 06, 10:30 AM 11:30 AM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "",
    "description": "In this practical, experience-driven session, we'll dive deep into the architecture and implementation of distributed systems that operate at massive scale. Through real-world case studies and battle-tested patterns, attendees will learn how to design, build, and maintain systems that reliably serve millions of users. Real-world examples from how we do it at Amazon",
    "speaker_name(s)": "Pavitra Thacker, Sanchi Agarwal",
    "time": "Thursday, November 06, 10:30 AM 11:30 AM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Tails of Kafka: How Pets Stream the Tea",
    "description": "tolerant event streaming for real-time analytics to microservice communication. In this beginner-friendly workshop, we'll demystify Kafka with real time data from gossip-loving cats via Kafka topics, producers and consumers. We'll introduce the core concepts including brokers, partitions, consumer groups and message offsets and dive into resiliency with Kafka. Participants will run kafka labs sending and receiving real-time pet drama. We will also discuss how adopting event streaming technologies enhances operational efficiency and supports innovation in various industries. By using real-world scenarios, we will demonstrate how Kafka addresses significant business needs, enabling organizations to remain competitive in a rapidly evolving landscape.",
    "speaker_name(s)": "Rosie Wang, Sarah Orsak, Theresa Wright",
    "time": "Thursday, November 06, 10:30 AM 11:30 AM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Breaking barriers in your tech career",
    "description": "From not seeing other faces that look like ours in leadership roles to dealing with self-limiting beliefs, stereotypes and biases, women face unique barriers to success in our technology careers. In this talk, which is both inspiring and practical, I will teach women how to break every internal and external barrier by intentionally picking an empowering response to a disempowering barrier. As as a first-generation college graduate with a bachelor's degree in computer science from University of Wisconsin-LaCrosse, an immigrant from humble beginnings and a single mother of my 2 children since they were 2 and 4, I had to learn how to break many internal and external barriers to became one of the highest-ranking women of color at IBM. The audience will learn how to show their worth instead of giving their power away to the barriers. They will also learn what truly matters when scaling the technology leadership ladder. They will become unbound and show up as leaders and role models.",
    "speaker_name(s)": "Shelmina Abji",
    "time": "Thursday, November 06, 01:00 PM 01:45 PM",
    "type": "Featured",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Breaking into Product Management: From Curiosity to Career",
    "description": "Product Management (PM) is rapidly growing in visibility and influence across industries, serving as the nexus between business goals, user needs, and technical execution. However, many aspiring professionals struggle to understand how to enter this field, especially without a traditional background in tech, business, or design. This presentation offers a comprehensive, insider perspective on how to successfully break into product management, covering real-world career paths, skill-building strategies, and industry expectations. Attendees will leave with a clear understanding of the PM role, a personal action plan, and the confidence to pursue or transition into this exciting field.",
    "speaker_name(s)": "Tabs Memon",
    "time": "Thursday, November 06, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Build Your Own AI Promotion Coach: A Hands-On Multi-Agent Workshop",
    "description": "Ever wish you had a personal coach to help you get promoted? Now you can build one. In this hands-on, beginner-friendly workshop, you'll learn how multi-agent systems can reduce hallucinations, increase trust, and guide users through high-stakes scenarios like promotion planning. Drawing from real-world lessons in enterprise AI development, co-facilitators Ishween Kaur and Uma Uppin will help you build your own AI Promotion Coach, a multi-agent chatbot powered by LLM APIs that breaks down vague ladders, crafts accomplishment summaries, and generates advocacy scripts. No deep ML experience required just curiosity and basic Python. You'll walk away with a working prototype, a new perspective on agent design, and practical trust-building patterns you can use in your own AI projects.",
    "speaker_name(s)": "Uma Uppin, Ishween Kaur",
    "time": "Thursday, November 06, 01:00 PM 02:00 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Career MVPs: Small Experiments, Smart Career Moves",
    "description": "",
    "speaker_name(s)": "Nikita Chhabria",
    "time": "Thursday, November 06, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Cybersecurity That Saves Lives: A Behind-the-Scenes Look at Digital Defense",
    "description": "Cybercrime is a trillion-dollar industry threatening everything from daily conveniences to national security. As a result, cybersecurity is one of the most mission-critical, fast-growing areas in tech. Yet the global shortage of cybersecurity professionals continues to grow, especially among women and nonbinary technologists. In this inspiring session, two women technologists join forces to share how their work helps stop threats before they spread. We'll walk through a real-world cyberattack, how it could have been prevented, and how your skills can shape a safer digital future.",
    "speaker_name(s)": "Krupa Srivatsan, Aditi Patange",
    "time": "Thursday, November 06, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Data Governance in Practice: Driving Business Results and AI Accountability",
    "description": "Data governance is often seen as policy-heavy or too technical. When put in practice, it keeps data usable, trustworthy, and aligned with business goals. It plays a central role in ensuring AI systems are built and used responsibly. Many organizations recognize the importance of data governance but struggle to move beyond policies and tool selection. The challenge is figuring out how to make it work in a fast-paced, cross-functional environment. Without a clear operational model, governance efforts stall, leading to poor data quality, unclear accountability, and increased risk in AI initiatives. This hands on workshop focuses on execution. Attendees will learn how to integrate data governance into daily business operations, where it can deliver real impact. Data Professionals and Executives will build practical data governance programs that support business priorities and reduce risk in AI initiatives.",
    "speaker_name(s)": "Diane Igoche, Ihotu Okopi",
    "time": "Thursday, November 06, 01:00 PM 02:00 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Designing for Scale: Tech and Culture Decisions That Last",
    "description": "In the ever evolving and changing software development environment, the pressure to deliver quickly and reuse what we have can lead to decisions that don't stand the test of scale or time. This session explores how to lead with a long-term mindset, sharing real-world lessons from designing and evolving scalable systems from technology and cultural aspects. We will explore frameworks for making high-impact architectural decisions, how to balance short-term delivery needs with sustainable growth, and how to guide teams toward building resilient, maintainable systems that last.",
    "speaker_name(s)": "Rita Chaturvedi, Mugdha Deshpande",
    "time": "Thursday, November 06, 01:00 PM 02:00 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Edge AI, Secured: Protecting Secrets in Disconnected Kubernetes Clusters",
    "description": "As AI workloads move to the edge—powering autonomous systems, smart manufacturing, and remote healthcare—securing sensitive data and models in disconnected environments is critical. Traditional cloud-based security models often fall short. This session explores vulnerabilities in edge AI deployments and features a live demo of real-world attacks and modern defenses. We'll examine how Kubernetes clusters at the edge can maintain strong security postures without constant cloud connectivity. Topics include zero-trust architectures, hardware-rooted trust (TPM, HSM), secrets encryption, policy enforcement, and container runtime protections. We'll also cover best practices for securing ML models and inference data in containerized environments. Attendees will leave with practical strategies for building secure, resilient AI infrastructure at the edge—enabling innovation without compromising trust or compliance.",
    "speaker_name(s)": "Anushka Khare, Aditi Mittal",
    "time": "Thursday, November 06, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Exploring Tech-Adjacent Careers— A No-Code Path to Success in Technology",
    "description": "Are you a soon-to-be or recent graduate or are you're a mid-career curious about thriving in tech without writing code every day? Join us for an insightful session that unveils the diverse and dynamic world of tech-adjacent roles—career paths that leverage your technical background while focusing on skills beyond programming. We'll explore exciting no-code opportunities These roles play a critical part in the technology ecosystem, bridging gaps between engineering, customers, and business. You'll learn what these roles entail, the skills needed to succeed, and how to navigate your career journey toward these impactful positions. Whether you're passionate about technology but want to apply your talents in communication, coordination, or strategic growth, this session will empower you with actionable insights and inspiration to chart your unique path in tech. Come discover how to build a successful, fulfilling tech career that aligns with your strengths and interests—no coding required!",
    "speaker_name(s)": "Liza Ogwel, Ayleen Kim, Rachel Leekin",
    "time": "Thursday, November 06, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "From Config to Confidence: Scaling Safe Rollouts and Experiments at Uber with Flipr",
    "description": "What happens when a config change accidentally disables payments in 50+ countries? At Uber's scale, changes must be made with precision. Enter Flipr — Uber's dynamic config and experimentation platform powering safe rollouts across 700+ services and 50K+ hosts. Flipr lets teams deploy features using rule-based configs (by geography, user, app version, etc.) without code changes, with support for real-time rollbacks, audits, and compliance gating. Built on top is Experiments, enabling A/B tests with real-time metrics via XP Monitoring. We'll share examples: how dispatch teams tune city-wise ETAs, how payments safely roll out methods, and how compliance blocks features dynamically — all without deploys. Learn how Flipr empowers teams to ship faster, experiment safely, and scale with confidence including Flipr's design, scaling challenges, and real-world use in dispatch, payments, and experimentation. Detailed overview and outline for the session are available in the linked doc.",
    "speaker_name(s)": "Aakanksha Khetan, Kriti Mehta",
    "time": "Thursday, November 06, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "From Features to Finances - A PM'eds Guide to Capturing Business Value",
    "description": "Many PMs build great products but struggle to show how they move the business forward. The true challenge lies in translating those products into tangible business value. This session delves into the concept of value capture- the process of converting products into business value. Through real-world examples, we'll explore how strategic decisions in monetization, pricing, customer segmentation, can significantly impact a product's profitability. Attendees will gain insights to: 1) Understand the distinction between value creation and value capture in product management. 2) Identify key strategies and frameworks for capturing business value from products. 3)Apply real-world examples to inform strategic product decisions that align with business goals. By the end of this session, participants will be equipped with actionable strategies to ensure their products not only meet user needs but also drive business success.",
    "speaker_name(s)": "Shravya Amarnath",
    "time": "Thursday, November 06, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "From Imposter to Impact: Thriving in Your First Tech Role",
    "description": "Starting your first full-time role in tech can feel like entering a maze—with no map, no compass, and the looming weight of imposter syndrome. From deciphering unspoken workplace norms to figuring out how to speak up in meetings or ask for feedback, it's easy to feel overwhelmed and alone. In this candid and practical session, we as early-career engineers share our journeys of growth, missteps, and breakthroughs. With real talk and real tools, we'll explore how to navigate the transition from student to professional, find your voice, and grow into a confident, impactful contributor. Whether you're in your first role or preparing for one, this talk will equip you with tangible strategies to thrive—not just survive—in your early tech career. You'll walk away with: Confidence-building tools to combat imposter syndrome Strategies to create visibility & demonstrate value in your team Lessons in navigating feedback, growth plans, & goal setting Building a support system (mentorship & more)",
    "speaker_name(s)": "Mansi Sharma, Deepanshi Singh",
    "time": "Thursday, November 06, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Lost in the AI Boom? How to Reclaim Your Space in Tomorrow'eds Tech",
    "description": "With AI dominating headlines and transforming the way we work, it's easy to feel like you're falling behind. If you've ever asked yourself, \"Do I still fit in?\" — you're not alone. This talk is a grounded, honest conversation about belonging in the AI era—for developers, designers, product managers, and anyone feeling overwhelmed by the pace of change. You don't need to be an expert in machine learning to be part of tech's future—you just need to start.",
    "speaker_name(s)": "Radhika Patwari, Aeshna Jain",
    "time": "Thursday, November 06, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Mastering Negotiation Skills: Empowering Women for Success",
    "description": "Navigating negotiations in a male-dominated field can be daunting. Yet, it's crucial to everything that matters in your career '96 promotions and career growth, gaining access to resources for peak performance, navigating work-life balance, and dismantling stereotypes. Mastering the art of negotiation is not just a career skill—it's a catalyst for personal empowerment and confidence for women in the workplace. This confidence emboldens the individual, paves the way for an equitable and inclusive work environment, and inspires women to embark on and excel in tech careers. Join this workshop to learn how to be an effective negotiator and practice your skills in a supportive environment. Together, we'll debunk myths, develop strategies for compelling arguments, and walk through successful negotiation strategies. Empower yourself to navigate negotiations confidently and shape your tech career.",
    "speaker_name(s)": "Charley Pincombe",
    "time": "Thursday, November 06, 01:00 PM 02:00 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Navigating a Dual Career- Tech Professional & Content Creator",
    "description": "Many women in tech feel pressure to choose between technical excellence and personal passions. In this session, I'll share how I've built a thriving career at AWS while growing a social media presence as a content creator with 50k+ followers. I'll discuss how I've translated technical storytelling into digital influence, navigated time management, avoided burnout, and found synergy between my dual identities. This session is for those wondering if they have to \"pick a lane,\" and encourages attendees to see how diverse skillsets can elevate—not distract from—a successful tech career.",
    "speaker_name(s)": "Tisha Arora",
    "time": "Thursday, November 06, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Sane by Design: How to build a Self-Care system in digital world",
    "description": "Ever found yourself answering Slack with one hand while microwaving your third coffee with the other—wondering if this is peak performance or just peak survival? This session is for high-achievers crushing deadlines but quietly crashing inside. Drawing from my own journey through weight loss, depression and burnout, while building high-impact products at Uber and Flipkart, I'll share how I applied Product Management principles of prioritization, feedback loops, and user empathy (with me as the user) to build a self-care system. You'll walk away with a framework to protect your energy, how to build a self-care stack suited to you, and doable rituals that fit even the most chaotic calendars. This isn't about quitting tech and moving to the mountains—it's about staying in the game without burning out. Come redefine success—where you feel good and get things done. Because, self-care isn't a break it is our secret weapon.",
    "speaker_name(s)": "Pooja Garg",
    "time": "Thursday, November 06, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Security - Secret Management Platform",
    "description": "At Uber, we run over 5,000 microservices, 5,000 databases, and over 500,000 analytical jobs per day and over 150,000 secrets facilitate authentication among these large, distributed ecosystems with multiple stakeholders. Cyberattacks continue to rise industry-wide, with exposed credentials being a leading cause. With this in mind, we set out on a mission to build a centralized, automated, and scalable solution for secrets management. To combat secrets sprawl, shadow IT vaults, and insecure secret sharing, and to facilitate the rotation of secrets when necessary, we kicked off a transformative journey building a Secret Management Platform. We assembled a set of thought leaders within the company to define Uber's Secret Management Standard and a visionary solution. In this presentation, I'll share how we built Uber's Secret Management Platform, solving key challenges and setting a new standard for secrets management.",
    "speaker_name(s)": "Ludi Li",
    "time": "Thursday, November 06, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Talk Money, Tell Stories, Make Moves: Leveling Up Your Career with Confidence and Connection",
    "description": "Pivoting into tech isn't always a straight line—and sometimes, it takes more than one pivot to land where you truly want to be. In this session, I'll share my journey of breaking into the tech industry after years of persistence, and how I made a second leap from a non-technical to a technical role at Uber. Along the way, I learned how to craft a compelling career story, build authentic connections, and negotiate for the salary and roles I deserved. Whether you're navigating a career change, preparing for your next big ask, or looking to grow your network with purpose, this session will give you actionable strategies—and a confidence boost—to help you make your next move with power and clarity.",
    "speaker_name(s)": "Elizabeth Chambers",
    "time": "Thursday, November 06, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Tech for Social Good in the Age of Generative AI: Designing for Equity, Accountability, and Impact",
    "description": "As technology reshapes every corner of society, we face a critical question: Can innovation be a force for justice, not just disruption? This session explores how technologists can drive Tech for Social Good — especially in the age of Generative AI (Gen-AI) — by building ethical, inclusive, and impact-driven systems. We'll examine how emerging technologies like Gen-AI are transforming access to education, healthcare, crisis response, and advocacy. But with that power comes responsibility: when AI generates content, decisions, or insights, whose values does it reflect — and who does it exclude? Through case studies, frameworks, and community centered strategies, this session will unpack: Gen-AI for Good: How AI is being used to support education, mental health and climate solutions Bias, Power and Policy: The social risks of AI tools Measuring Impact: Defining success beyond efficiency or engagement Cross-Sector Collaboration: Why tech, nonprofits, policy, and academia must align",
    "speaker_name(s)": "Sreedevi Mohan",
    "time": "Thursday, November 06, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Career Comeback: Navigating the Return to Professional Life",
    "description": "As an Amazon Technical Program Manager with 7 years of technical experience and an 8-year career break raising children, I've successfully navigated the challenging journey back to the workforce. In my 3+ years at Amazon, I've earned a promotion and transitioned from technical role to program management while balancing family life. Career breaks, whether from family commitments, relocation, or visa issues, can be daunting. This session presents a practical framework for workplace reintegration, focusing on: Confidence rebuilding Skill enhancement Market re-entry strategies Drawing from personal experience, I'll share actionable steps to transform career gaps into growth opportunities. My journey proves that with strategic planning, resilience, and proper support, success in tech leadership is achievable while maintaining work-life balance. Whether you're planning your return or already transitioning, join me to learn practical strategies for your next professional chapter.",
    "speaker_name(s)": "Akshata Shrivastava",
    "time": "Thursday, November 06, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Charting New Territories: Academia Meets Data & AI Strategy",
    "description": "Embark on a journey from organizational psychology to leading data and AI strategy at Manulife, a global insurance leader. This presentation unveils my unexpected transition, highlighting how academic insights in psychology have fueled innovative strategies that drive technological and organizational growth. Discover how my experiences in consulting and banking have shaped my strategic vision and execution in the rapidly evolving tech landscape. Attendees will learn about the power of interdisciplinary approaches, the value of data-driven decision-making, and the vital role of leadership in fostering an AI-enabled future. This session aims to inspire professionals from diverse backgrounds to harness their unique experiences, positioning themselves as leaders in the data and AI revolution. Join us to explore how your journey can redefine industry landscapes and drive transformative change.",
    "speaker_name(s)": "Vivien Wong",
    "time": "Thursday, November 06, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Cloud Economics and Financial Management: A Strategic Imperative",
    "description": "Cloud computing has transformed business operations, creating new financial challenges that require executive attention. The shift from capital to operational expenditure demands new financial disciplines. Without proper management, cloud costs can spiral 20-50% higher than anticipated due to underestimated consumption, orphaned resources, and overprovisioning. This creates budget volatility affecting strategic planning and shareholder value. Effective cloud financial management serves as a strategic enabler. The FinOps framework brings together finance, technology, and business teams to manage cloud costs through three phases: Inform, Optimize, and Operate. Companies with mature cloud management practices typically achieve 20-30% cost savings while improving operational agility. This requires new governance models, automation tools, and organization-wide financial literacy. When properly implemented, cloud financial management becomes a strategic advantage.",
    "speaker_name(s)": "Vidhi Seem, Arpine Soghoyan",
    "time": "Thursday, November 06, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Code-Switching Through Generations: Stories of Cultural Duality in Tech",
    "description": "Through personal stories of cultural duality, this session explores how navigating traditional values and modern tech identities shapes the experiences of underrepresented technologists. Attendees will reflect on themes of identity, belonging, and resilience in the workplace. Attendees will gain: '95 A better understanding of how culture influences behavior, communication, and collaboration '95 Practical ways to support cultural inclusion in tech teams '95 Renewed appreciation for the power of storytelling as a leadership and community-building tool",
    "speaker_name(s)": "Neha Hemant Raut",
    "time": "Thursday, November 06, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Docs Or It Didn't Happen - Writing A Design Document For A Future You",
    "description": "Have you ever struggled to determine the reasoning behind a particular system solution choice? What happens if it is a legacy system or the engineers who worked on it left the team or firm? Have you ever jumped straight into coding only to significantly change the implementation later? Design docs come to your rescue! They prompt system design discussions with your team and help identify shortcomings. A well-written design doc makes coding significantly easier, as it provides a step-by-step implementation roadmap. It should showcase architecture, diagram critical components, pros & cons of different solutions, tech stack, and data sources. Design docs are a true game changer! In this presentation, we will discuss how to write a design doc — structure, tips, and tricks. We will talk about how to find the right level of detail and how to provide clarity. We will then introduce a real life data-driven example and draft a design doc for it.",
    "speaker_name(s)": "Zuzanna Matysiak",
    "time": "Thursday, November 06, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Emotional Intelligence For Success and Well-Being",
    "description": "Professional success requires more than just IQ and \"hard\" skills. In fact, research shows that emotional intelligence accounts for a majority of long-term success. It's the ability to be calm under pressure and resilient in the face of adversity. It's having a positive outlook and knowing how to attune to others. Come and learn how to increase your emotional intelligence so you can generate even greater success—for yourself and the people around you. With emotional resilience, you can do more than just survive'85 you can thrive! You'll learn techniques to be more positive, to calm down when stress rears its head, and develop more grit and resilience.",
    "speaker_name(s)": "Mary Nielsen, Charis Loveland",
    "time": "Thursday, November 06, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "From Curious Girls to Confident Builders: Empowering the Next Generation of Technologists",
    "description": "We can't be what we can't see—yet millions of girls who are curious about technology never get the chance to see themselves as technologists. As woman in tech and a Solutions Architect's at AWS, We've seen firsthand the transformative power of visibility, mentorship, and early exposure. This session explores practical, scalable strategies to ignite interest in technology among girls from elementary school through high school—and keep them engaged. We will cover key areas like identifying what motivates girls to explore technology—and what often holds them back—so we can design experiences that truly resonate. Explore how to use AWS tools like Educate, Cloud Quest, and Code Whisperer to create hands-on, beginner-friendly projects that build both skills and confidence. We'll also talk about the power of storytelling and visible role models in helping girls see themselves in tech—and how you can use your own story to make a lasting impact",
    "speaker_name(s)": "Ramya Siruvuri, Mythili Annamalai Sekar",
    "time": "Thursday, November 06, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Get Funded! Breaking Barriers for Women Founders",
    "description": "Access to capital remains one of the greatest challenges for women entrepreneurs but it doesn't have to be. In this dynamic session, discover how women founders are challenging the status quo, securing funding, and building thriving, scalable businesses. Hear from an expert panel who share real-world insights on navigating bias, pitching with confidence, and leveraging networks and resources to unlock funding opportunities. Whether you're launching your first startup or preparing for your next investment round, this session will equip you with the tools, strategies, and inspiration to overcome barriers and get funded.",
    "speaker_name(s)": "Pamela Lee, Veronica Michael, Jerome Edwards, Shana Cooper-Silas",
    "time": "Thursday, November 06, 02:15 PM 03:00 PM",
    "type": "Featured",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Lessons from the Quiet Room: Rethinking How to Listen to Customers",
    "description": "Most Customer Advisory Boards (CABs) sound great on paper—but in practice, they become feedback theater or worse, a roadmap pitching ground. If you are thinking CABs are about talking to customers, that's the myth I want to debunk. It's about learning to listen differently. In this session, I'll share how I built and scaled a CAB for an enterprise product at Microsoft, and why it did NOT work—until I rewired it using lessons from Rob Fitzpatrick's The Mom Test and personal insights from how neurodiversity teaches us to communicate differently. What honest customer conversations actually sound like, i.e. not like a roadmap review, how to ask questions that invite truth instead of praise, and how to make silence your most strategic tool. Whether you're building B2B products or driving customer experience, you'll leave with actionable techniques to design more honest, insight-rich customer conversations—driving roadmap clarity, stakeholder alignment, and stronger customer relationships.",
    "speaker_name(s)": "Saloni Yadav, Ruth Magyar",
    "time": "Thursday, November 06, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "",
    "description": "How many of you feel the subtle differences when you're on your period? Did you ever go into a guilt/denial phase, when you prioritized health over work? Did you overstress and felt guilty that you worsened your menstrual cycle? This is a sensitive topic for quite a few people who menstruate. Do you know that the stress is real? Do you know the cycle is your superpower if you work with it? You wear multiple hats at work, as a Software Engineer or any job profile in Tech. Get to know how to best sync your roles with the phases of your cycle! Let's bust some myths as I share how I trained myself to tune in with my cycle and made it my strength at work.",
    "speaker_name(s)": "Akanksha Gupta",
    "time": "Thursday, November 06, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Oops, I Clicked: Behind the Scenes of Website Compromises",
    "description": "Have you ever wondered what's behind that suspicious link? In our chronically online world, we inevitably stumble upon malicious and compromised websites. How we react helps protect ourselves from malware downloads and personal information theft. This seminar offers a behind-the-scenes glimpse at common malware and phishing schemes, from initial click to action on objectives. Participants will view demonstrations of common website compromises they may encounter in the wild, and will learn how to reduce harm when encountering one of these compromised sites. Attendees will leave this session with actionable steps to defend themselves against malware threats, both proactively and in the heat of the moment.",
    "speaker_name(s)": "Haley Hochberg, Kathleen Hablutzel",
    "time": "Thursday, November 06, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Tales of a Neurodiverse Engineer",
    "description": "According to a HBS study, the unemployment rate for neurodiversity is as high as 80%. This talk explores a tale of an engineer who dealt with an undiagnosed disability while managing her workload while exploring the challenges of accommodations and support in the workplace as an engineer.",
    "speaker_name(s)": "monica para",
    "time": "Thursday, November 06, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "The Magic of Digital/Physical Convergence at Disney: Engineering Systems to Drive Data Insights",
    "description": "At Disney, magic isn't just created — it's engineered. In a world where digital and physical experiences are increasingly intertwined, it's essential to not only consider feature delivery, but also how to deliver innovation and insight at scale. Software system design, data, and business value can seem disjointed, as it is easy for a software engineer to build a system with solely the user experience in mind. But the data from these user interactions is equally important, and is essential for business strategy. Embedding this consumer understanding up front in system design can unlock immediate insights. There is a single Guest experience at Disney - one that traverses the digital and physical spaces. It takes technologists to power the magic and bring these experiences to life. This session highlights how understanding the Guest experience and the Parks business strategy informed the engineering and data design of an exciting new system in our parks.",
    "speaker_name(s)": "April Breedlove",
    "time": "Thursday, November 06, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "The Unlikely Superpower: Turning a Non-Technical background into Tech success",
    "description": "",
    "speaker_name(s)": "Katherine Taylor",
    "time": "Thursday, November 06, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Unlocking Cybersecurity: Launch Your Career and Debunk the Myths",
    "description": "Explore cybersecurity with this approachable guide designed for aspiring professionals! We will demystify the field, debunk common myths, and illustrate how diverse roles — from compliance to red, blue, purple teams, and security engineering — collaborate to protect our digital landscape. Explore abundant opportunities, understand key concepts, and visualize your potential career path through an end-to-end workflow. Whether you're considering a switch or just starting, this session will equip you with foundational knowledge and inspire confidence to launch your successful cybersecurity career.",
    "speaker_name(s)": "Prerana Mahalanobis, Sai Manogna Duttaluri",
    "time": "Thursday, November 06, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Zero Downtime, Infinite Stakes: Case Study of Migration of LinkedIn'eds Authentication Databases",
    "description": "At large enterprises like LinkedIn, login is the gateway to everything. Behind this simple step is complex infrastructure that must reliably scale to billions of sessions while ensuring security, performance, and uptime. Over time, evolving this system—to cut costs, boost performance, or ditch legacy tech—makes database migrations essential. This talk covers LinkedIn's real-world case study of migrating its authentication database—with 5B+ records—from Oracle to MySQL, achieving zero downtime and full data accuracy. It highlights technical, operational, and architectural challenges of this transition in a live environment where availability and correctness are critical. Attendees will learn about: -Challenges of migrating a high-scale login system with 5B+ records and zero downtime -Benchmarking new infrastructure for scale and latency -Safe validation, ramp-up, and cutover strategies -How AI partners with engineers to improve reliability and decision-making during complex migrations",
    "speaker_name(s)": "Saloni Mundra",
    "time": "Thursday, November 06, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Accessibility First: Designing Mobile Apps for Everyone",
    "description": "Millions rely on mobile apps daily—but are we truly designing for all? With the latest Web Content Accessibility Guidelines (WCAG) 2.2, inclusive design isn't optional—it's essential. Accessibility isn't just a checkbox; it's a necessity. This session bridges the knowledge gap in mobile accessibility, diving into real-world challenges and practical strategies for building inclusive apps from day one. We'll kick off with a trivia to test your accessibility awareness, then explore TalkBack and VoiceOver optimizations, color contrast, touch targets, and dynamic scaling. You'll complete a hands-on audit of your favorite app and walk away with tools, checklists, and a new mindset to prioritize accessibility. Whether you're a developer, designer, or product manager, this session equips you to create mobile experiences that don't just meet guidelines, but feel seamless and empowering for every user.",
    "speaker_name(s)": "Catherine Fang, Angel Han",
    "time": "Thursday, November 06, 02:30 PM 03:30 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Agent squad : Learn Multi-Agent Development with Google Agent Development Kit",
    "description": "",
    "speaker_name(s)": "Abheesht Sharma, Divyashree Shivakumar Sreepathihalli, Samaneh Saadat",
    "time": "Thursday, November 06, 02:30 PM 03:30 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Break It 'Til You Make It: Building Reliability Through Testing",
    "description": "From unit tests to black-box strategies, this hands-on workshop explores how meaningful testing practices contribute to software reliability. Attendees will uncover bugs, fix flaky tests, and design effective test strategies in a collaborative learning environment.",
    "speaker_name(s)": "Palak Gupta, Shreya Singh",
    "time": "Thursday, November 06, 02:30 PM 03:30 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Lighting the Bits: Making Equality of Opportunity a Reality",
    "description": "Despite increasing awareness and effort, the gender gap in science, technology, engineering, and mathematics (STEM) remains stubbornly persistent. These barriers begin early and meaningful exposure to hands-on learning and visible role models, many young girls begin to opt out of STEM pathways long before they've had the chance to explore them. In this interactive, hands-on workshop, attendees will explore how to use Micro: bits to design and deliver engaging STEM events for girls in underserved communities. Whether you are a first-time volunteer or a seasoned STEM advocate, this session will equip you with the tools, curriculum, and real-world strategies to organize impactful outreach events rooted in creative, kinesthetic learning.",
    "speaker_name(s)": "Natalie Goldstein, Gauri Mishra, Lilith Matthews, Ifteda Ahmed-Syed",
    "time": "Thursday, November 06, 02:30 PM 03:30 PM",
    "type": "Workshop",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "AI and Data for Everyone: Empowering Through Innovation",
    "description": "Democratizing AI and data is vital for empowering every level of an organization. This presentation explores strategies to make AI accessible to all, from frontline workers to leaders, showcasing the transformative power of these technologies. I will discuss integrating AI across functions to drive efficiency, and innovation. Key topics include implementing user-friendly AI tools, like Manulife's internal ChatGPT-like system, which boosts productivity and decision-making. We will examine real-world applications, such as document summarization for legal teams and underwriting tools for agents, that have enhanced business processes. Moreover, the session will highlight the importance of strategic leadership in fostering AI and data literacy, ensuring advancements benefit the entire workforce and spur growth. This presentation aims to inspire organizations to use AI and data as empowering tools, creating a more inclusive workplace.",
    "speaker_name(s)": "Vivien Wong",
    "time": "Thursday, November 06, 03:30 PM 04:15 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Beyond Code: Thinking Like a User-Centric Data Scientist",
    "description": "Being a successful data scientist isn't just about coding and analytics—it's about deeply understanding your users, their needs, and crafting impactful solutions. This session will explore the critical skill of asking the right questions, developing empathy for users, and driving value by focusing less on technical complexity and more on meaningful outcomes.",
    "speaker_name(s)": "Anh Le",
    "time": "Thursday, November 06, 03:30 PM 04:15 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Beyond the Code'd6 Navigating Leadership as a Woman in Tech",
    "description": "Breaking into tech is one challenge, but breaking through into leadership is another. For women in technology, the path to influence and leadership often requires navigating unspoken rules, systemic barriers, and internal doubts. This session explores what it really takes to grow beyond your technical contributions and step into leadership with authenticity and confidence to make an impact.",
    "speaker_name(s)": "Farah Rana",
    "time": "Thursday, November 06, 03:30 PM 04:15 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "F1 to FTE: Turning Pressure into Purpose",
    "description": "As international women in tech pursuing master's degrees on F1 visas, we—Deepna and Manisha—faced immense challenges: visa stress and the fear of resume rejection. But we didn't just survive—we thrived. We secured internships that led to full-time roles at Uber Freight, navigating cultural shifts, technical hurdles, and systemic biases. In this session, we'll share our journey from F1 students to full-time engineers, revealing how we leveraged AI tools, strategic resume tactics, bold networking, and resilience to turn pressure into purpose. We'll dive into how we cracked our first tech internships, transformed them into career-defining opportunities, and why the industry needs more women like us. Attendees will leave with actionable tips to beat the ATS, impress recruiters, build their voice, and confidently navigate the job search as women in tech—dreaming big, coding hard, and staying bold.",
    "speaker_name(s)": "Manisha Bobba, Deepna Thalanki",
    "time": "Thursday, November 06, 03:30 PM 04:15 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "From Fixed Frameworks to Strategic Enablers: A CIO playbook for AI Transformation",
    "description": "Abstract: Traditional architectural approaches have become unsustainable for technology leaders navigating today's AI-driven landscape. Architecture is no longer a checkpoint at the end of development but must be woven throughout the entire AI transformation lifecycle. As organizations demand more tangible evidence of AI value and competitive advantage, enterprises must fundamentally transform how they approach architecture by shifting from rigid frameworks to strategic enablement.",
    "speaker_name(s)": "Shawn McCarthy, Garima Sharma",
    "time": "Thursday, November 06, 03:30 PM 04:15 PM",
    "type": "Presentation",
    "category": "Senior to C-Suite",
    "experience_level": ""
  },
  {
    "session_name": "Mentorship That Works: No Cadence, No Problem",
    "description": "Mentorship isn't about a standing calendar invite. It's about timing and trust. In this session, two technologists from different generations share the true story of their evolving relationship built around real-time problem solving, from successfully advocating for promotions and navigating workplace dynamics to setting boundaries. A visual timeline of key touchpoints will show how impactful mentorship doesn't follow a set cadence—it's intentional. The talk will give insight into how to structure effective mentor and sponsor asks with context, clear goals, and optionality. Get practical strategies to craft \"asks\" that respect time, demonstrate ownership, and build long-term advocates. The experts will share how to approach candid conversations with empathy and grace when it's time to slow down or step away from a mentorship that's no longer aligned. You'll leave with a toolkit to turn professional crossroads into meaningful conversations that spark bold career moves.",
    "speaker_name(s)": "Christina Mitine, Christine Sandman Stone",
    "time": "Thursday, November 06, 03:30 PM 04:15 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "OK Are You Ready to Talk About OKRs?!",
    "description": "Don't let your OKRs be MIA - unlock the power of this framework to set goals that truly deliver results! Whether you're an intern, a full-time developer, or a team lead, it can sometimes be difficult to quantify and communicate your impact. OKRs (Objectives & Key Results) are an essential tool that provides structure and clarity in helping you advocate for your contributions and excel in your role. In our presentation, we will teach you everything there is to know about OKRs and how they differ from other goal-setting frameworks. We will cover how to define an OKR, how to write a good OKR, and how to use them in your projects to measure and highlight impact to stakeholders. Setting up OKRs ahead of projects will empower you to grow into a strong, goal-oriented engineer who can showcase the full extent of the impact you create. Join us to learn how this simple yet transformative goal-setting framework can drive alignment, focus, and measurable success in your career and contributions.",
    "speaker_name(s)": "Madison Rosen",
    "time": "Thursday, November 06, 03:30 PM 04:15 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Rewriting the Roadmap: Choosing Self-Care over Burnout In Tech",
    "description": "At 36, I was a staff scientist on the management track at Uber - driven, high-performing, and perpetually \"on.\" Then came a breast cancer diagnosis that changed everything. What began as a personal health crisis forced a professional reckoning: What does success look like when your energy is finite? What happens when self-care is no longer optional, but vital? In this talk, I'll share how I worked with my employer to redesign my role - stepping off the management path, relocating, and reclaiming time and space to heal. I'll explore the emotional and cultural challenges of making that shift in an industry that often equates value with velocity and visibility. This is not a story of burnout and recovery, but about conscious tradeoffs in a digital world that rarely stops moving. I'll offer reflections and takeaways for anyone rethinking their relationship with ambition, identity, and work, especially those navigating health challenges, caregiving, or simply craving a more sane pace.",
    "speaker_name(s)": "Georgeann Gumina",
    "time": "Thursday, November 06, 03:30 PM 04:15 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Sustainable Engineering: Building Smarter and Greener Systems at Scale",
    "description": "",
    "speaker_name(s)": "Tanaya Salunkhe",
    "time": "Thursday, November 06, 03:30 PM 04:15 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Tech Success from Within: Building Mental Resilience and Sustainable Self-Care Practices",
    "description": "",
    "speaker_name(s)": "Ritu Dubey, LeeAnne Dewar",
    "time": "Thursday, November 06, 03:30 PM 04:15 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "The Data Backend of Disney+: Deep Dive on Backend Query Service White Rabbit",
    "description": "A high-level architecture overview of a backend Disney Streaming service (White Rabbit) that queries data and resolves results based on availability of the user geographically, ratings, language preferences, and more, all while holding all the data in memory with no connection to a database. The specific service is unique in that there is no database connection, yet it holds millions of unique data structures. This allows for low latency in both querying and writing data. During peak times, the service can easily handle up to 40k requests/second, with an average P99.99 of only around 97 milliseconds. Tech stack: AWS, rxJava, Kinesis, Kafka, cqEngine, Vertx",
    "speaker_name(s)": "Lilith Matthews",
    "time": "Thursday, November 06, 03:30 PM 04:15 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "The Power of the First Step: From Remote Beginnings to Global Tech",
    "description": "This session is an honest, motivational journey of breaking into tech from unconventional beginnings. Aimed at students and early-career professionals, it focuses on building confidence, taking initiative, and finding your place in tech—even when it feels out of reach. Through personal stories, practical insights, and lessons learned, attendees will leave inspired to take their first step, embrace learning, and actively shape their career paths.",
    "speaker_name(s)": "Bhavya Tummala",
    "time": "Thursday, November 06, 03:30 PM 04:15 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "The Scenic Route to Tech: Why Detours Are a Good Thing",
    "description": "",
    "speaker_name(s)": "Kajal Bansal",
    "time": "Thursday, November 06, 03:30 PM 04:15 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Unbound by Bias: Building AI That Liberates, Not Limits",
    "description": "As AI systems scale, technologists must make critical architectural decisions that influence not only model performance, but fairness, maintainability, and real-world impact. This session explores responsible AI at scale—how to design pipelines that optimize both technical excellence and ethical accountability. Attendees will learn architectural patterns for retraining loops, monitoring bias drift, and enforcing fairness constraints in distributed systems. The talk combines real production experiences with open-source tools and design tradeoffs, equipping attendees to build AI systems that scale without sidelining responsibility. Audience members will leave with the confidence to lead infrastructure decisions that impact millions, while keeping inclusion, transparency, and trust at the core of their work.",
    "speaker_name(s)": "Sakshi Chaturvedi, Neha Sharma",
    "time": "Thursday, November 06, 03:30 PM 04:15 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "AWS Security Jam: Gamified Learning for Cloud Security and Incident Response",
    "description": "As organizations increasingly migrate to the cloud, many professionals lack practical experience with cloud security and incident response. The AWS Security Jam offers a hands-on, team-based learning environment where participants explore real-world scenarios using AWS services. This interactive session functions like a Capture-the-Flag (CTF) challenge, with a live leaderboard to foster friendly competition. AWS provides all the infrastructure, allowing attendees to focus on solving security challenges, building their cloud skills, and collaborating with peers. By the end of the session, participants will have a deeper understanding of AWS security tools, best practices, and incident response strategies—all while networking with like-minded professionals in a gamified, risk-free environment.",
    "speaker_name(s)": "Aarjvi Desai, Anjana Krishnan",
    "time": "Thursday, November 06, 04:00 PM 05:00 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Build Your First Mobile App in Under an Hour Using GenAI",
    "description": "While women are underrepresented across all fields of software engineering, the gender disparity is even greater in mobile, with under 20% of mobile engineers being women. Mobile is a valuable niche within software development, with over $520bn of mobile app revenue in 2024 and a growing demand for mobile developers, projected at 22% in this decade. Additionally, there has been a stark rise in AIi within programming, with 92% of U.S.-based developers using AI coding tools. The goal of this workshop is to help women to gain exposure to modern mobile development and inspire them to potentially pursue it as a career path. In this workshop, participants will learn how to properly utilize GenAI to assist in building a fully functioning mobile application. Participants will walk away with a fully functional mobile app that can help them plan out the conference talks they want to attend and a basic understanding of mobile development with GenAI.",
    "speaker_name(s)": "Ariella Silver Mendel, Madona Wambua",
    "time": "Thursday, November 06, 04:00 PM 05:00 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Technical Interview Workshop: Recognizing and Applying Key Coding Patterns",
    "description": "Let's get ready to ace your next technical interview! In this hands-on workshop, attendees will work in groups to tackle a variety of coding problems designed to highlight essential algorithmic patterns—such as sliding window, two pointers, linked lists, merge intervals, cyclic sort, and more. Together, we'll break down each problem and practice the right strategies to identify patterns and solve them efficiently. You'll walk away with practical tools, enhanced problem-solving skills, and greater confidence to succeed in technical interviews.",
    "speaker_name(s)": "Bakhyt Abisheva, Yue Ding, Sophie Ni",
    "time": "Thursday, November 06, 04:00 PM 05:00 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "What caring for our environment can teach you about software performance & resource optimisation",
    "description": "As a great software engineer, you already care about performance and building resilient systems. Bringing environmental care into the mix might seem like a detour from this plan '96 but, in fact, it is a shortcut. In this hands-on workshop, you will use a development environment containing a mock system with replica services. You will apply green software principles to reduce software emissions of this system and, through guided exercises, better understand how these principles align with established software engineering design techniques. In the process, you will also learn to measure the resulting reduction in carbon emissions. By the end of the workshop, you will recognize that you do not need to be an expert in green computing to make your software more sustainable. You will walk away with a handy guide and be able to apply knowledge gained from the workshop to improve performance and utilization of resources in your organization or personal projects.",
    "speaker_name(s)": "Stuart Perks, Gosia Waszak",
    "time": "Thursday, November 06, 04:00 PM 05:00 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Academy or Industry? The Dilemma of an Academician Who Jumped Into a Startup Journey",
    "description": "When I graduated from the university with the degree of Computer Engineering, one thing I was 100% sure was that, one day, I was going to be a professor. I always loved research and teaching. Accordingly, I started my master's degree in Computer Science, and after that, I didn't veer the car and continued with my PhD in Computer Science. I eventually became a professor after my postdoc and have been working in academia for years. I have been always happy with this decision and I have never ever regretted this decision. This is the career I have always pursued with my all heart and full effort. But, was it the end? As a computer scientist and a research-oriented person, I was always after knowledge and tended to dig new topics deeper. As a computer engineer, I have always looked for ways to learn and integrate new technologies and create useful tools. And one day, five years ago, a question came up in my mind! Why don't I start a small start-up company? Well... the adventure began.",
    "speaker_name(s)": "Gizem Kayar Ceylan",
    "time": "Friday, November 07, 10:30 AM 11:15 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Boundaries are your best friend!",
    "description": "In fast-paced, always-on work environments, boundaries are often misunderstood as limitations. But in reality, they are essential tools for protecting our time, energy, and well-being. This talk reframes boundaries as a career strategy—not a constraint. Through personal storytelling and research, we'll explore the hidden costs of overcommitment, emotional labor, and the pressure to always say yes. Attendees will reflect on their personal and professional goals, learn how to set and communicate boundaries with confidence, and discover strategies to align their daily actions with long-term success. Whether you're managing a team or managing your own bandwidth, this session will help you move from burnout to balance—by recognizing that boundaries aren't barriers to success; they're the structure that makes success sustainable.",
    "speaker_name(s)": "Sheila Oh",
    "time": "Friday, November 07, 10:30 AM 11:15 AM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Demystifying RAG: Build a Retrieval-Augmented Generation App from Scratch",
    "description": "Retrieval-Augmented Generation (RAG) is one of the most practical and powerful techniques in modern AI—enabling applications to pull from custom knowledge sources to generate relevant, grounded responses. In this workshop, you'll build a simple RAG pipeline from scratch using open-source tools. No prior AI experience is required—just curiosity and a laptop. By the end, you'll have a working demo and a clear understanding of how RAG works under the hood.",
    "speaker_name(s)": "Ayushe Nagpal",
    "time": "Friday, November 07, 10:30 AM 11:30 AM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Designing the Future: Building Inclusive AI Through Human-Centered Thinking",
    "description": "As AI systems increasingly shape how we learn, work, and interact, ensuring these systems reflect diverse human needs is not just a technical challenge—it's a design imperative. In this talk, I'll share frameworks and actionable strategies for thinking about inclusive design in AI development, drawing from my research on human-AI interaction, content moderation, and scientific discovery tools. We'll explore how to center marginalized perspectives, mitigate bias in model development, and embed explainability and transparency into AI workflows. This session invites designers, developers, and researchers to rethink how inclusion can be baked into AI from the start—not added on later.",
    "speaker_name(s)": "Sanjana Gautam, Kamala Payyapilly Thiruvenkatanathan",
    "time": "Friday, November 07, 10:30 AM 11:15 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Ensuring development and feature rollout confidence",
    "description": "This session will cover the guardrails my team and I implemented at Uber for features with over 1 million daily users and 41 million lifetime users to date. These guardrails help ensure confident feature rollouts and ongoing monitoring. Most software engineers can attest that coding makes up only about 10% of our time. The rest is spent on tasks such as requirements gathering, testing, and monitoring. There's a lot we can do to support a feature's success—but how do we channel that effort into implementation confidence? In this session, we'll explore different types of guardrails used before and after a feature rollout. We'll discuss how these guardrails help prevent feature leaks, maintain confidence when building on top of existing features, and the tradeoffs involved when choosing between different validation strategies to guard against regressions.",
    "speaker_name(s)": "Rosita Wong",
    "time": "Friday, November 07, 10:30 AM 11:15 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Exploring Generative AI Societal Risks, AI Red Teaming, and Automation",
    "description": "Generative AI (GenAI) has quickly increased in popularity and is being incorporated into almost every domain, from healthcare to military defense. GenAI presents a unique landscape for risks and harms, and with the explosion of more capable AI applications, these risks are becoming increasingly complex and important. In this talk, we discuss how automation is necessary to make the red teaming process efficient and flexible. Automated attacks can identify risks at scale and open-source AI libraries help make these tools available to everybody as well as foster a collaborative environment for further improving the tooling and automation. By proactively identifying vulnerabilities and safety harms before products are released, we can work towards a safer AI future.",
    "speaker_name(s)": "Nina Chikanov, Bolor-Erdene Jagdagdorj",
    "time": "Friday, November 07, 10:30 AM 11:15 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "From Storytelling to Scrum: Empowering Your Transition into Tech",
    "description": "The allure of a career in tech can be undeniable, yet the perceived technical barrier often discourages individuals from non-technical backgrounds from pursuing this path. This presentation aims to demystify the transition journey and empower individuals, particularly women, to leverage their existing skills and break into the exciting world of technology. My own story embodies the power of such a transition. Growing up, Disney wasn't just a childhood icon, it was a symbol of creativity and storytelling. It was a dream come true when I landed a position at the company. However, my journey took an unexpected turn when I discovered a passion for problem-solving and the potential to utilize technology to translate stories into interactive experiences. Despite lacking a formal background in coding or tech-specific skills, I embarked on a journey of self-discovery and upskilling, successfully transitioning into the dynamic field of product management.",
    "speaker_name(s)": "Stephanie Singer",
    "time": "Friday, November 07, 10:30 AM 11:15 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Getting Started with GraphQL: Build Smarter APIs",
    "description": "GraphQL is revolutionizing the way developers build and consume APIs, no more over-fetching or juggling multiple endpoints. In this fast-paced, beginner-friendly workshop, attendees will build and query their very first GraphQL API using JavaScript and Apollo Server. We'll start with the basics: what GraphQL is, how it compares to REST, and why it's gaining so much momentum in modern web development. Then, participants will follow along in a live coding session where they'll define types, write resolvers, and test their API using GraphQL Playground. By the end of the hour, they'll have a working project they can build on and the confidence to use GraphQL in their own applications. Whether you're a frontend developer seeking to overcome REST limitations or a backend engineer exploring modern API architectures, this workshop is your gateway to GraphQL.",
    "speaker_name(s)": "Shweta Deshmukh, Isha Talegaonkar",
    "time": "Friday, November 07, 10:30 AM 11:30 AM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Invisible Engineers: Why Data Infrastructure Deserves a Seat at the Product Table",
    "description": "This presentation focuses on highlighting the impact of data engineers and discussing ways to draw visibility to the work done by them.",
    "speaker_name(s)": "Meghna Kattamuri",
    "time": "Friday, November 07, 10:30 AM 11:15 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Lakehouse: One Stop Shop for all your Data",
    "description": "We present a deep dive of Legend Lakehouse - Goldman Sachs' cloud-native solution to securely store & access firm's analytical data. Lakehouse is integrated with the Goldman Sachs open -source Legend data platform. We will briefly describe existing pain points with data & how Lakehouse addresses them. We will present Lakehouse architecture & discuss interesting design choices such as use of Iceberg open table format to provide interoperability across multiple query engines. Lastly, we will demonstrate an end-to-end workflow of how a quantitative strategist can use Legend Lakehouse to ingest, experiment with, and analyze a sample dataset, illustrating Lakehouse's intuitive access control mechanisms & integrated data quality controls. Attendees will learn cloud storage concepts, how to ingest data to the cloud & different query mechanisms. They will glean how data storage is managed at a platform level for multiple user personas & understand product development process of Goldman Sachs.",
    "speaker_name(s)": "Ruhi Dongre",
    "time": "Friday, November 07, 10:30 AM 11:15 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Mastering Data Collection Pipelines: How to Build Resilient Event-Driven Architectures",
    "description": "Modern applications generate massive amounts of data that need to be ingested, processed, and stored efficiently to power real-time insights and analytics. Yet building scalable, resilient data collection pipelines remains a major challenge for many organizations. This session will demystify the design of robust event-driven data pipelines capable of handling billions of events reliably. We'll cover event sourcing principles, idempotency, retry mechanisms, failure handling, and building fault-tolerant ingestion architectures using tools like Kafka, Spark, and Delta Lake. Through real-world examples, attendees will learn to identify common failure points and design around them. Whether you are building pipelines for analytics, AI, or customer personalization, this session will equip you with the architectural foundations needed to design data pipelines that scale gracefully, deliver quality data downstream, and support evolving business needs without compromising performance or trust.",
    "speaker_name(s)": "Manasa Hari",
    "time": "Friday, November 07, 10:30 AM 11:15 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "MLOps with Kubeflow: Scalable Model Deployment on Kubernetes",
    "description": "In this hands-on session, we'll take a machine learning model from a Jupiter notebook to a fully managed, automated MLOps pipeline using Kubeflow on Kubernetes. You'll learn how to orchestrate training workflows, deploy scalable model-serving endpoints, and monitor performance — all inside a Kubernetes-native ecosystem. Perfect for ML engineers, DevOps pros, and data scientists looking to productionize their models the right way.",
    "speaker_name(s)": "Tulasi Gamidi, Satya Bhargavi",
    "time": "Friday, November 07, 10:30 AM 11:30 AM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Multi modal Databases and simplified application development",
    "description": "Analysis shows multimodal databases reduce development time by 40-60% while improving cross-modal query performance by up to 300%. Applications include content recommendation systems, medical diagnostics integrating patient records with imaging, and IoT platforms combining sensor data with multimedia content. As data types diversify, multimodal databases become essential for efficient application development.",
    "speaker_name(s)": "Tammy Bednar, Rachna Mohanka",
    "time": "Friday, November 07, 10:30 AM 11:15 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Navigating the Maze: Extracting and Analyzing Forensic Artifacts in Containerized Environments",
    "description": "As organizations increasingly adopt containerization technologies like Docker and Kubernetes to streamline application deployment, the forensic landscape is evolving rapidly. Containerized environments present unique challenges for digital forensic investigators due to their ephemeral nature, complex networking setups, and distributed architecture. This presentation aims to shed light on the intricacies of conducting forensic investigations in containerized environments and provide practical strategies for extracting and analyzing forensic artifacts. In this session, we will delve into the world of containerized environments and explore the key challenges faced by digital forensic investigators. Attendees will gain insights into the lifecycle of containers, from deployment to termination, and understand how this dynamic environment impacts forensic analysis.",
    "speaker_name(s)": "Iris Yuning Ye",
    "time": "Friday, November 07, 10:30 AM 11:15 AM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Scaling Data Enrichment with LLMs: A Hands-on Workshop",
    "description": "Master the implementation of Large Language Models (LLMs) for efficient offline data enrichment. This workshop addresses the growing need for efficient LLM implementation in data processing workflows. Many organizations struggle with scaling LLM solutions, managing costs, and maintaining consistent quality in batch processing. Drawing from production experience at Amazon AGI, this workshop provides hands-on strategies for building robust LLM systems. Participants will learn to overcome common challenges in model selection, prompt engineering, and infrastructure scaling while implementing practical solutions for real-world data enrichment scenarios. Through hands-on exercises, you will build a production-ready LLM pipeline handling real-world data enrichment scenarios. Learn to enhance customer data, augment product information, and automate complex classification tasks.",
    "speaker_name(s)": "Muskaan Goyal, Tejashri Naikar",
    "time": "Friday, November 07, 10:30 AM 11:30 AM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Software Developer, Product Manager, And Sometimes Both At The Same Time",
    "description": "The proposed session is on guiding participants through transitioning to their desired career role. Through activities like SWOT analysis, competency matrix, and attendees identify transferable skills, bridge gaps, and prepare for their transition. With solo reflection and group discussions, they craft resumes, practice interviews, and brainstorm networking strategies. Attendees leave with actionable plans and confidence to navigate their career transition effectively. This workshop equips them with tools and resources to pursue meaningful opportunities aligned with their aspirations.",
    "speaker_name(s)": "Utsha Sinha",
    "time": "Friday, November 07, 10:30 AM 11:15 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Unifying QA and DevOps: A Leadership Blueprint for Continuous Quality",
    "description": "This session explores how I led the unification of QA and DevOps at Morningstar, transforming siloed teams into a cohesive, high-impact engineering function. By challenging long-standing assumptions, we redefined how quality and delivery coexist, treating them not as a separate goal but as a shared discipline. Through thoughtful automation, modern CI/CD strategies, and the targeted use of AI-driven tools, we evolved from quarterly releases to a model of frequent, high-integrity delivery, maintaining compliance while improving reliability, speed, and customer confidence. Attendees will learn to identify and dismantle systemic friction points with lean, strategic changes. I'll share how we evolved our engineering culture to increase ownership, deepen accountability, and reframe our role around continuous value creation. Whether you're a developer or a director, this session offers a blueprint for integrated, resilient engineering.",
    "speaker_name(s)": "Parina Chhibber",
    "time": "Friday, November 07, 10:30 AM 11:15 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Unleash Your Voice: Selling Ideas with Conviction & Impact",
    "description": "Are you feeling unheard or unseen? Struggling to influence much needed change within your organization? Unsure how to navigate office politics and ensure your ideas appeal to your peers/leaders? You're not alone! Early career professionals are often susceptible to falling victim to their own self-doubt and struggle to capture the attention of their audience — leaders, peers, and partners. Tailoring ideas to the audience's passions and presenting with conviction are critical to obtaining buy-in and influencing change within an organization. During this session, we'll cover strategies for articulating complex concepts clearly, anticipating and navigating objections, and presenting with confidence. Empower yourself to advocate for your innovations and build a reputation as a rising leader/influencer early in your career!",
    "speaker_name(s)": "Cynthia Carter",
    "time": "Friday, November 07, 10:30 AM 11:15 AM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Women Shaping Wearables: Creating Cutting-Edge AI Technology",
    "description": "",
    "speaker_name(s)": "Julia Levy, Hind Hobeika, Michelle Pujals, Ming Hua, Kelly Ingham",
    "time": "Friday, November 07, 10:30 AM 11:15 AM",
    "type": "Panel",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "AI-Crafted Resumes: Build a Winning Resume Using Prompt Engineering",
    "description": "Stand out in today's job market with AI-powered resumes! In this engaging session, learn how to use Generative AI and prompt engineering to craft role-specific, ATS-optimized resumes. We'll walk through extracting keywords from job posts, generating customized resumes using tools like OpenAI and Gemini, scoring resume-job fit, and leveraging compensation insights from platforms like levels.fyi or Glassdoor. Whether you're a job seeker, coach, or recruiter, this hands-on demo will equip you with tools to create high-impact resumes, assess your fit for roles, and confidently negotiate offers—turning AI into your career advantage.",
    "speaker_name(s)": "Manisha Bobba, Deepna Thalanki",
    "time": "Friday, November 07, 11:45 AM 12:30 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "AI-Driven Endpoint Privilege Management: Reducing Attack Surfaces in the Modern Enterprise",
    "description": "As cyber threats grow in sophistication, even well-protected networks remain vulnerable when user privileges are excessive or poorly managed. In this session, you'll learn how combining least-privilege principles with AI-powered threat detection can transform your security posture. We'll cover: Why privilege management matters: How over-privileged accounts become targets for lateral movement and ransomware Applying least-privilege frameworks: Strategies for auditing, enforcing, and automating privilege reduction across endpoints AI in security operations: Real-time anomaly detection, predictive risk scoring, and dynamic policy enforcement Data-driven reporting: Using dashboards and analytics to prove compliance and measure risk reduction Attendees will leave with an actionable plan to integrate endpoint privilege management and AI tools—empowering teams to detect and stop threats before they spread.",
    "speaker_name(s)": "Divinee Chidume",
    "time": "Friday, November 07, 11:45 AM 12:30 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Building for Uptime: Backend Reliability in Uber'eds Architecture",
    "description": "Reliability at Uber is designed into the architecture—not bolted on later. In this talk, I'll share how backend engineers at Uber build for uptime across systems that power trip flows, fares, and real-time user experiences. We'll cover how we approach multi-region infrastructure, service tiering, failover planning, and high-scale resilience. You'll learn how architectural decisions like dependency isolation, deployment sequencing, and capacity planning contribute to our reliability goals. Whether it's traffic surges during global events or handling cascading failures across services, this session provides practical strategies for building dependable systems that support millions of users, every day.",
    "speaker_name(s)": "Rutva Patel",
    "time": "Friday, November 07, 11:45 AM 12:30 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Curious, not Confused: How You Can Make Technical Discovery Your Product Superpower",
    "description": "It's a Bird, It's a Plane, It's'85 a PM? Even if you do not see yourself as technical, technical discovery can be your superpower. What do you do when the problem is buried in platform code, the proposed solution sounds like developer magic, and stakeholders want clarity on impact? This talk offers practical tools for product managers and engineers to lead discovery and communicate impact in complex systems, from app infrastructure to user-facing experiences. Whether you are exploring tech debt work, aligning on architecture, or uncovering new levers for customer experience, you will learn how to frame tradeoffs, ask better questions, and create forward motion, without needing all the answers.",
    "speaker_name(s)": "Genevieve Fowler",
    "time": "Friday, November 07, 11:45 AM 12:30 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Engineering Uber'eds Next-Gen Payments Platform: Reliability, Scale, and Global Reach",
    "description": "This abstract describes a session focused on Uber's next-generation global payments platform. It highlights the system's massive operational scale, including approximately 120 million daily financial transactions and support for 34 million daily trips (as of Q1 2025) across more than 70 countries and 15,000 cities. The abstract will delve into the engineering ingenuity, architectural principles, and specific design choices behind this platform, all aimed at achieving robust reliability, extensive scalability, and adherence to global financial compliance standards for Uber's diverse payment needs.",
    "speaker_name(s)": "Manasi Thakkar",
    "time": "Friday, November 07, 11:45 AM 12:30 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "From Zero to Petabytes: 5 Patterns and Top 10 Architectures for Resilient Real-Data-Intensive System",
    "description": "Data is the core of every modern application—but designing systems that process, store, and move data at scale is hard. This session distills key principles from data-intensive architecture design. We'll explore consistency trade-offs (CAP theorem), replication strategies, distributed consensus, and storage engines. Through case studies involving messaging systems, analytics platforms, and real-time apps, we'll unpack patterns like event sourcing, write-ahead logs, materialized views, and caching. Whether you're building from scratch or evolving an architecture, you'll leave with clarity on how to design robust, scalable, and future-ready data systems.",
    "speaker_name(s)": "Manasa Hari",
    "time": "Friday, November 07, 11:45 AM 12:30 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Intelligence Unbound: Foundation ML Models revolutionizing Technology",
    "description": "",
    "speaker_name(s)": "Shruti Makharia, Shanthini Chetlur Kannan",
    "time": "Friday, November 07, 11:45 AM 12:30 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "My Secret Weapon at Work: How I Use ChatGPT to Think, Write, and Lead Better",
    "description": "Everyone is talking about AI replacing jobs, but what if you could use it to excel at yours? In this talk, I share how I use ChatGPT as my secret weapon to perform at the next level in a senior technical role. From debugging machine learning experiments and brainstorming new product features to summarizing research papers and preparing for high-stakes presentations, ChatGPT is part of my weekly workflow. It helps me think more clearly, write more effectively, and lead with confidence. This session goes beyond the hype and shows how to practically embed generative AI into your daily routine. You will walk away with prompt templates, productivity systems, and new ways to use AI not just to work faster, but to improve your thinking and communication. Whether you're mid-career or already senior, you'll leave with tools and ideas to integrate ChatGPT into your growth journey.",
    "speaker_name(s)": "Akriti Chadda",
    "time": "Friday, November 07, 11:45 AM 12:30 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Powering Billions: How Uber Scales Real-Time Financial Transactions",
    "description": "What does it take to process over 56 million trips and 1.5 billion financial transactions a day — and still close the books on time? In this high-energy session, go under the hood of Uber's Finance Computation Platform (FCP), the powerful backend engine that translates global trip data into accurate, auditable financial records at scale. Learn how event-driven architecture and fault-tolerant systems come together to power real-time accounting in one of the world's most complex and dynamic marketplaces. If you've ever wondered how tech meets finance at scale — this is your deep dive.",
    "speaker_name(s)": "Lahari Avvaru, Satya Bhargavi",
    "time": "Friday, November 07, 11:45 AM 12:30 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Putting the Sand in Sandbox: Fostering Tech Careers in Puerto Rico",
    "description": "What if cutting-edge AI agents and software solutions were built, far from usual tech hubs, on the shores of Puerto Rico? Xtillion shares how our engineers, either returning home or discovering one, are creating world-class tech through skill-development opportunities, internal product incubators, and purpose-driven work. Whether you're returning, rebuilding, or just reimagining where your path could go, this is a blueprint for building boldly—wherever you choose to bloom.",
    "speaker_name(s)": "Christian Sanchez, Claudia Arrese Mata",
    "time": "Friday, November 07, 11:45 AM 12:30 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Revolutionizing Software Development: From Vibe Coding to Prompt Driven Development",
    "description": "Explore the revolutionary shift in software development as we dive into emerging paradigms: Vibe Coding and Prompt Driven Development. Discover how these approaches are transforming traditional coding practices by leveraging AI pair programming. Learn practical strategies for effective prompt crafting, understanding AI capabilities, and maintaining code quality while significantly accelerating development velocity. Through real-world examples and hands-on demonstrations, understand how to adapt your development workflow for the AI-augmented future. Drawing from our extensive experience at Amazon AGI, we'll examine when and how to effectively use each approach, their strengths and limitations, and best practices for maintaining code quality.",
    "speaker_name(s)": "Muskaan Goyal, Pranav Bhasin",
    "time": "Friday, November 07, 11:45 AM 12:30 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Scaling AI-Driven Quality Control: Lessons from Monitoring 800K+ Financial Assets Daily",
    "description": "How do you ensure quality and reliability across 800,000+ investment data points processed every day? This session explores a real-world AI deployment at Morningstar that modernized anomaly detection in financial data pipelines. Using a multi-layer framework, the system integrates scalable data processing, LSTM-based real-time monitoring, expert-in-the-loop feedback, and dependency-aware alerting to minimize false positives while enhancing trust and reliability. Attendees will learn how to architect AI-driven quality control that balances automation with explainability, leverages human judgment for better accuracy, and maintains compliance in highly regulated environments. This talk provides practical insights for technologists seeking to integrate AI into complex production workflows without compromising data integrity or operational confidence.",
    "speaker_name(s)": "Anusha Dwivedula",
    "time": "Friday, November 07, 11:45 AM 12:30 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Smart Money: Financial Literacy and Goal-Based Planning in the Age of AI",
    "description": "In a world where AI powers investment platforms, robo-advisors suggest portfolios, and fintech apps claim to make you rich, how do you take control of your financial future? This session offers a grounded, tech-aware guide to personal finance for the modern professional. We'll break down the fundamentals of goal-based financial planning, explain key investing principles (risk, diversification, compounding), and explore how AI tools can empower—or mislead—your financial decisions. You'll learn: '95tHow to define and prioritize your financial goals '95tThe basics of investing: asset classes, risk tolerance, and common mistakes '95tHow to evaluate AI-driven financial tools—and use them wisely '95tThe difference between being \"money busy\" and \"money smart\" Whether you're saving for a home, planning a sabbatical, or just trying to break the paycheck-to-paycheck cycle, this talk delivers a no-fluff roadmap to build confidence and clarity with money, backed by data and behavioral insights",
    "speaker_name(s)": "Jaya Eripilla, Rebecca Caleb",
    "time": "Friday, November 07, 11:45 AM 12:30 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "The PM in the Machine: Building Human-Centered Products in the Age of AI",
    "description": "AI is changing how we build—but it shouldn't change why we build. In this talk, I'll share how product leaders can shape the future of AI by grounding innovation in user needs, ethics, and clarity. I'll cover practical lessons from leading Generative AI strategy at Uber, including how to align cross-functional teams, translate complexity into value, and avoid building tech for tech's sake. Whether you're a PM, engineer, or designer, you'll leave with tools to lead AI efforts that are as responsible as they are revolutionary.",
    "speaker_name(s)": "Meghana Somasundara",
    "time": "Friday, November 07, 11:45 AM 12:30 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "uber Chaos to Clarity - Lighting Up Your Logs",
    "description": "Imagine your log files as an endless group chat—messages flying everywhere, and you're hunting for the important tea. At Uber, our Airport Live Observability system turned the chaos of millions of logged messages into calm with Kafka and Grafana. In this talk, you'll: Tame the Gossip: See how a unified Kafka consumer corrals millions of events in real time. Filter the Noise: Enrich and route logs so only critical signals get through. Stage the Highlights: Build Grafana dashboards with templates, thresholds, and alerts that spotlight real issues. Win the Speed Race: Apply three quick tweaks—index tuning, dynamic alerts, and panel grouping—to slash debugging time by 20%. Packed with witty stories, clear diagrams, and live demos (no Kafka or Grafana experience needed), you'll leave with a battle-tested blueprint to turn any log-stream meltdown into a five-star operation. Come for the laughs, stay for the insights!",
    "speaker_name(s)": "Atandrila Anuva",
    "time": "Friday, November 07, 11:45 AM 12:30 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "AI Agentic Masterclass: Multi-Agent System Development with LangGraph, Memory & HIL",
    "description": "Are you eager to do a deep dive into the practical aspects of constructing intelligent multi-agent AI systems? This immersive session with practical insights offers participants the opportunity to gain familiarity and experience with LangGraph, the framework designed for orchestrating complex multi-agent workflows. Through structured content, attendees will learn to implement crucial agent capabilities, including both short-term conversational context and long-term knowledge persistence. The session will also cover the integration of human-in-the-loop mechanisms to enhance control and safety within agentic systems. By the conclusion of this masterclass, participants will acquire the practical skills and confidence necessary to design, deploy, and evaluate production-ready multi-Agent system end-to-end. The session is structured to facilitate the transition from theoretical understanding to tangible end-to-end AI Agent development.",
    "speaker_name(s)": "Reeti Sarup",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Beyond the Box: How Strategic Team Switches Unbind Careers and Systems",
    "description": "After over three years at Pinterest and Uber, we each made a bold move: switching teams within our companies. Though we live and work in different countries, we were driven by similar motivations: burnout, curiosity, and a desire to gain new perspectives without leaving our organizations. In this session, we'll share how we approached these transitions, the challenges we faced, and what we learned about ourselves, our careers, and the systems we work on. From stepping into unfamiliar domains to rebuilding technical credibility and adjusting to new team dynamics, we'll reflect on the personal and professional growth that followed. We'll also explore the ripple effects of these changes, from refreshed energy in codebases to stronger cross-functional collaboration, and offer practical strategies for engineers and leaders looking to evolve without starting over.",
    "speaker_name(s)": "Larissa Barabasz, Crystiane Meira",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Certifications as Confidence Catalysts: Conquering Impostor Syndrome in Tech",
    "description": "Navigating a career in technology—whether breaking in or leveling up—often feels like a high-stakes journey fraught with self-doubt. For many, particularly women and underrepresented minorities, impostor syndrome is a persistent barrier, casting doubt on skills and worth, especially when tackling new roles or technologies. This session reimagines industry certifications—not just as technical credentials, but as powerful tools for building confidence and combating self-doubt. In this talk, we'll explore how certifications in areas like cloud, security, and networking provide structure, validation, and visibility in your tech journey. More than just resume boosters, certifications act as a psychological reset, offering tangible proof of expertise and a renewed sense of purpose. Through a blend of personal storytelling, practical strategies, and actionable insights, attendees will leave empowered to use certifications to unlock both external opportunities and internal confidence.",
    "speaker_name(s)": "Snehal Nahar, Ramya Mikkilineni",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Decoding the Human Element in CyberSecurity: Innovative Strategies for Combating Insider Threats",
    "description": "Insider threats, whether driven by malice or human error, are becoming increasingly sophisticated and harder to detect. This session explores the nuanced spectrum of insider threats, from accidental data exposure to deliberate sabotage, and presents innovative strategies to address them. We'll delve into the AI-powered user behavioral analytics systems that help detect anomalous patterns, as well as techniques for hardening initial access and curbing lateral movement. The session will spotlight how Uber is implementing a zero-trust security model to proactively identify and mitigate internal risks before they lead to major incidents.",
    "speaker_name(s)": "Neelima Kumar",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Digital Empathy: How AI Is Transforming Mental Health and Emotional Wellness for Aging Populations",
    "description": "By 2050, more than 2 billion people globally will be over the age of 60. This demographic shift is not just a statistical milestone—it represents a profound transformation in how we must approach mental health, emotional wellness, and care delivery for aging populations. With older adults facing rising rates of loneliness, cognitive decline, and limited access to consistent emotional support, the urgency for innovative, scalable solutions is greater than ever. This session explores how emerging technologies—particularly AI—can be leveraged to meet these needs with dignity, empathy, and care. It focuses on the role of emotionally intelligent AI in supporting mental health and enabling proactive self-care among seniors, while offering design and ethical insights applicable across populations.",
    "speaker_name(s)": "Dhanashri Phadke, Jenn Lien",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Freshman to Full-Time: Internships, Research Publications and the SWE Roadmap",
    "description": "Landing your first software engineering internship can feel like a long shot—but it's absolutely possible with the right strategy. This session breaks down a practical, step-by-step roadmap to help college students stand out early. Attendees will learn how to build a compelling resume with limited experience, leverage personal projects and GitHub, network effectively (even without connections), and navigate career fairs and online applications with confidence. We'll also cover how to identify freshman-friendly opportunities, tailor outreach messages, and how to prepare for technical interviews. Whether you're just starting out or already applying, this session will equip you with actionable tools, tips, and a mindset shift to help you land that first offer—sooner than you think.",
    "speaker_name(s)": "Asmita Sharma",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "From Code to Strategy: Transitioning from Software Engineer to Product Manager",
    "description": "Curious about Product Management but unsure how to make the leap from Software Engineering? In this practical and empowering session, a former Microsoft software engineer—now a thriving PM at Microsoft—shares the real-world playbook for a successful transition. Learn the skills that matter, the mindset shifts required, and the honest truth about what works (and what doesn't). Whether you're exploring new career paths or ready to make the move, you'll walk away with actionable tips, insider insights, and a framework to evaluate if PM is right for you—and how to break in if it is.",
    "speaker_name(s)": "Aditi Patange",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Mentoring Circles that Matter: Building Inclusive Communities of Growth",
    "description": "Mentoring circles are more than a buzzword—they are a powerful, scalable model for fostering inclusion, leadership, and community in tech. This session will explore how to design, launch, and sustain mentoring circles that truly make a difference. Whether you're starting from scratch or looking to revitalize an existing program, you'll leave with a blueprint for building inclusive spaces where growth is mutual and leadership is shared.",
    "speaker_name(s)": "Denise Gramsky",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Mind the Gap: Bridging AI Power with Human Perspective",
    "description": "\"Aren't you afraid AI will take your job?\" It's a common question often based on a misunderstanding of what AI can and can't do. This fear fuels the misconception that data roles are easily replaced. In reality, data teams should see AI as a lever to amplify their impact. From our experience building AI workflows and guiding adoption, we've found that successful implementation depends on context—and that context comes from human understanding of systems and processes. While AI excels at automating repetitive tasks, it's human judgment that ensures solutions are applied meaningfully. As a result, the nature of work evolves: data teams shift from execution to strategy, bringing insight AI alone can't replicate. This session will explore how to design human-in-the-loop AI workflows that empower rather than replace, enabling teams to work smarter. We'll share lessons from 13 months of building and scaling AI solutions at West Monroe—and our take on AI's impact on developer roles.",
    "speaker_name(s)": "Meghan Patel, Julia Waggoner",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Remote but Not Alone: Implementing the IGLOO Framework in Remote Work Environments",
    "description": "The widespread adoption of remote work has revealed an emerging crisis in workforce mental health, with 64% of executives surveyed by the Integrated Benefits Institute (IBI) indicating remote work negatively impact their employees' mental health. This session examines how the empirically validated IGLOO framework (1) can be systematically applied to address the mounting mental health crisis in remote work environments. Through analysis of implementation across varied organizational contexts, we demonstrate how this five-level intervention approach - Individual, Group, Leader, Organization, and Outside - creates a comprehensive support structure for remote worker wellbeing.",
    "speaker_name(s)": "Archana Dhere, Jamie Jhoe",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Science + Comedy: Finding Joyful Solutions to Serious Problems",
    "description": "What happens when sharp scientific thinking meets the art of laughter? In this engaging and unconventional session, explore how humor can spark creativity, break down complex ideas, and inspire innovative problem-solving. Scientist and Comedian Sophie Shrand will use storytelling and satire to tackle pressing global challenges, this conversation reveals how joy and curiosity can coexist with rigor and impact. Discover how embracing playfulness can open new pathways to collaboration, communication, and breakthrough solutions—because sometimes, the smartest way to solve serious problems starts with a smile.",
    "speaker_name(s)": "Sophie Shrand",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Featured",
    "category": "Mental Health in Tech",
    "experience_level": ""
  },
  {
    "session_name": "The AI Product Lifecycle 'f1 Navigating from Ideation to Execution",
    "description": "This session offers a practical and structured approach to navigating the full AI/ML product lifecycle—from identifying the right problems to solving with AI, to building responsible and scalable solutions, to ensuring programmatic support for long-term success. This session also provides a framework that emphasizes strategic evaluation, collaborative execution, and adaptable program management. Designed for product and program managers, this session equips attendees with actionable strategies to deliver high-impact AI/ML products responsibly and effectively.",
    "speaker_name(s)": "Ankita Singh, Aishwarya Gupte",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "The Founder'eds Table: How We Built AI Empires from the Ground Up",
    "description": "Why join a seat at someone else's table when you can build your own? In this talk, learn from two leaders on how they built thriving AI communities. - Maryam Farooq who is the founder & director of New York Artificial Intelligence (NYAI), a global community of over 10k AI builders, founders, and investors since 2016. - Melissa Barr who is the organizer and lead for the NYC chapter of Women in Machine Learning and Data Science (WiMLDS), relaunching it into a 5k-member powerhouse with a 10-woman board. We'll walk through the exact steps we took, from forming a mission, structuring leadership teams, and recruiting talent, to building partnerships, hosting impactful events, educating the community and sustaining long-term momentum. Whether you want to start a local chapter or launch the next global tech organization, this duo talk will equip you with the blueprint, real-world examples, and confidence to build your own AI community. Let's build your empire together!",
    "speaker_name(s)": "Catherine Yin, Melissa Barr",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "The Gen Z Tech Stack for IoT: GenAI & WebAssembly at the Edge",
    "description": "The future of IoT isn't in the cloud—it's at the edge, inside your wristwatch, your factory line, or a crop field 500 miles from the nearest datacenter. Welcome to the Gen Z tech stack: where Generative AI meets Web Assembly to power a new generation of intelligent, secure, and lightning-fast edge applications.",
    "speaker_name(s)": "Gayathri Jegan mohan",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Trim the Fat: Build Lean, Sustainable Data Pipelines",
    "description": "Join us to explore the top strategies for building data pipelines that are efficient, cost-effective, and environmentally responsible. You'll learn how intermittent and autoscaling designs, cloud-native tools, and smart storage choices can reduce your pipeline's carbon footprint. Sam Altman's remark that \"Please\" and \"Thank You\" to ChatGPT waste millions in compute power is a reminder that every inefficiency, no matter how small, adds up at scale. This session will show you how to optimize every step—because in the world of data, efficiency is sustainability.",
    "speaker_name(s)": "Archana Inapudi, Indira Balakrishnan",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Trusting the Invisible Pilot in the Evolution of Autonomy in Tech",
    "description": "Autonomy has been part of our world far longer than most people realize. From the first airplane autopilot to today's intelligent systems, invisible pilots have quietly shaped the way we travel, explore, and interact with technology. We see them in planes, cars, space missions, and even in everyday tools but as machines take on more decisions, the real challenge isn't just what they can do, it's whether we can trust them. Learning Objectives u003culu003e tu003cliu003eTrace the journey of autonomy from early aviation autopilots to today's cross-industry systems.u003c/liu003e tu003cliu003eUnderstand why trust between people and autonomous systems is so critical.u003c/liu003e tu003cliu003eLook at the ethical and safety challenges that come with designing autonomy.u003c/liu003e tu003cliu003eEncourage attendees to bring responsibility and transparency into the future of autonomous design.u003c/liu003e u003c/ulu003e",
    "speaker_name(s)": "Spriha Deshpande",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": ""
  },
  {
    "session_name": "Unbound by Fear: Thriving in Threat Intelligence Through Curiosity, Chaos, and Community",
    "description": "This talk would focus on my lived experience being a manager in the Microsoft Threat Intelligence Center (MSTIC) - navigating steep learning curves, onboarding during chaotic periods, and supporting others. Through my story I will provide techniques to operate in any environment unbound by fear or uncertainty.",
    "speaker_name(s)": "Chelsie Stevenson",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Voice in the Noise: Influencing AI Product Teams with Insight, Empathy, and Strategic Research",
    "description": "In today's fast-paced, AI-driven tech world, product teams often chase quick wins—leaving little to no time for a deep, shared understanding of the user. This talk is for researchers, designers, engineers, PMs, and cross-functional partners who want to lead with clarity and impact—regardless of role or title. I'll share lessons from leading UX research for Microsoft Teams Calling and AI features, and previously at Cisco Webex, to show how insights can shape strategy—even without formal authority. I'll reflect on my journey from being the quietest person in the room to confidently influencing roadmaps, advocating for inclusion, and collaborating across disciplines. Attendees will walk away with practical strategies to build trust, embed research into decision-making, and amplify their voice on any team. Whether you're early in your career or growing your influence, this session will equip you to lead from wherever you are.",
    "speaker_name(s)": "Priyanka Kuvalekar",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Your Docs Are Your Superpower Use Them to Get Seen and Promoted",
    "description": "",
    "speaker_name(s)": "Mikaela Klein, Maria Rodriguez",
    "time": "Friday, November 07, 01:00 PM 01:45 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Crash-Proof Code with Erlang: A Hands-On Introduction",
    "description": "",
    "speaker_name(s)": "Amrita Aurora",
    "time": "Friday, November 07, 01:30 PM 02:30 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "From Pull Requests to People Problems: Making the Leap to Manager",
    "description": "You were great at your job'85 so they gave you a new one. Welcome to management — where the problems are fuzzier, the wins are harder to measure, and no one really explains how to do the job. This workshop is for anyone who's newly made the leap (or thinking about it) and wants the real talk about what it means to shift from doing the work to enabling others to do it. We'll dive into the emotional rollercoaster of people management, the awkward art of giving feedback, and the juggling act of prioritization. Through hands-on scenarios, small-group reflection, and shared war stories, you'll leave with tools, insights, and a little more confidence that yes, you can lead — even if it feels like chaos sometimes.",
    "speaker_name(s)": "Jade Tabony, Amanda Iverson",
    "time": "Friday, November 07, 01:30 PM 02:30 PM",
    "type": "Workshop",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Messaging Magic at Disney Using AI and AWS",
    "description": "Discover Messaging Magic at Disney Using AWS Technologies and AI Coding Assistant! This workshop covers building a large-scale messaging system using AWS tools like Lambda, DynamoDB, DynamoDB Streams, and Kinesis. Learn AWS IAM permissions, roles, and use Amazon Q for code generation and debugging. Gain hands-on experience deploying Lambda functions via AWS console and Terraform, testing with DynamoDB triggers, and using CloudWatch for monitoring and logging. Designed for programmers with basic AWS knowledge, this workshop provides practical skills for real-world AWS implementations.",
    "speaker_name(s)": "Marium Mannan, Mitali Jain",
    "time": "Friday, November 07, 01:30 PM 02:30 PM",
    "type": "Workshop",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Advancing Eldercare with AI: Intelligent Companions and Human-Centered Systems",
    "description": "By 2050, over 2 billion people globally will be aged 60+, sharply increasing the need for innovative solutions to address loneliness, mental health, cognitive decline and compassionate caregiving. There is a need to empower and enrich the lives of seniors. This engaging session highlights cutting-edge digital game designs and intuitive adaptive interfaces, illustrating how practical and thoughtful technology can profoundly improve elderly care. Leveraging in-depth research, pilot studies, and strategic insights, attendees will discover practical AI implementations that foster emotional connections, cognitive enrichment, and greater independence for seniors. The presentation will highlight: 1. Why AI is a force for Social Good 2. AI Companions and Mental Health Solutions for emotional support and stress reduction 3. Innovative Game-Based Experiences for cognitive simulation 4. Hyper personalized Legacy keeper - Storytelling across generations 5. Building Trust: Ethical & Inclusive AI",
    "speaker_name(s)": "Dhanashri Phadke, Jenn Lien",
    "time": "Friday, November 07, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "advanced"
  },
  {
    "session_name": "Artificial Intelligence in Open-Source Project Management",
    "description": "As artificial intelligence continues to evolve, there is a growing need for project maintainers to leverage on AI to foster diverse and inclusive collaborations. In this session, I will discuss the importance of artificial intelligence in open-source project management, actionable strategies to maximize diverse talents and promote transparency, tools and technologies available for project maintainers, and practical ways to leverage these technologies to make a meaningful impact within open-source communities.",
    "speaker_name(s)": "Joyce Dzifa Lokko",
    "time": "Friday, November 07, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "Balancing Self Care and Productivity while Working from Home",
    "description": "In today's career landscape, many companies are encouraging employees to work in the environment that they thrive in - whether that is working from home, hybrid work, or full-time in the office. While working from home is a flexible option that many enjoy, it's not always easy. The difficulties of maintaining focus while in a potentially distracting environment, creating and sticking to a schedule, and keeping a work-life balance are only some of the things to consider and tackle while working from home. In this presentation, we'll be going over our own journeys working from home, skills we've developed, and resources that people may be able to generalize to their own work.",
    "speaker_name(s)": "Rachita Gupta, Sonia Ionescu",
    "time": "Friday, November 07, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Behind the Brand: Women Founders Tell All",
    "description": "Building a brand takes vision, resilience, and a willingness to share your truth. In this candid panel discussion, successful women founders pull back the curtain on their entrepreneurial journeys—the wins, the setbacks, and the lessons learned along the way. Hear from a panel of trailblazers who built their brands from the ground up, navigated challenges, cultivated loyal audiences, and stayed authentic through growth and change. From defining your brand's purpose to leading with impact, this conversation offers real talk and actionable insights for anyone ready to turn an idea into a lasting legacy.",
    "speaker_name(s)": "Tony Wilkins, Sophie Shrand, Christine Izuakor, Amanda Lannert",
    "time": "Friday, November 07, 02:15 PM 03:00 PM",
    "type": "Featured",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Democratizing Math: Duolingo's Journey to Unlock STEM Access for Every Learner using AI",
    "description": "Math confidence is the strongest early predictor of who pursues, and stays, in technical careers, yet women remain drastically under-represented in advanced math pathways. At Duolingo we asked: \"What if the same playful, mobile-first magic that opened doors to language could also open doors to calculus?\" This session recounts our quest to teach the entire K-12+ math continuum (in free, bite-sized, and globally scalable lessons) by pairing learning-science craft with the rapid evolution of large language models. You'll hear inside stories of setbacks (LLMs that \"hallucinated\" fractions), breakthroughs (grading at scale without bias), and the product principles that kept us shipping. Expect an honest look at data-driven iteration, the ethics of equitable AI, and why putting more women at the whiteboard (both as builders and as learners!) changes outcomes for the next generation of technologists.",
    "speaker_name(s)": "Nickey Skarstad",
    "time": "Friday, November 07, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "From Breaks to Breakthroughs: My 17-Year Journey in Tech, Family, and Growth",
    "description": "This talk shares my unconventional 17-year journey as a woman in tech in India. I began my career at HP/HPE, driven by curiosity and passion for engineering. While working full-time, I pursued a part-time master's degree, balancing early marriage and a growing career. Motherhood brought new challenges, and I took a 5.5-year break to support my child's speech and language needs. During this time, I relocated to my hometown, enrolled in a PhD program, and completed 75 Coursera courses using a student license—an effort featured in a top Indian magazine. With strong family support, I returned to my previous company and later secured a remote role at Microsoft. This is a story of resilience, reinvention, and the quiet strength of women who adapt and thrive. Key Takeaways: * How to navigate career breaks with purpose and preparation * Staying technically relevant through online learning * Enabling inclusive careers through remote work * The role of family and self-belief in long-term success",
    "speaker_name(s)": "Cynara Justine",
    "time": "Friday, November 07, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "From Handshakes to Opportunities: Mastering Networking in Tech",
    "description": "Networking is a cornerstone of career success in tech, yet it can feel daunting, especially for women and underrepresented groups navigating a competitive industry. The session will provide statistics and data about the gender challenges and provide pro tips for overcoming gender challenges. At large industry gatherings where thousands of tech professionals converge, the opportunity to build meaningful connections is unparalleled—but only if you know how to approach it. This session equips attendees with practical, inclusive strategies to network with purpose, fostering authentic relationships that open doors to mentorship, collaboration, and career growth. We'll explore how to prepare for networking events, initiate conversations with confidence, and follow up effectively to sustain connections.",
    "speaker_name(s)": "Snehal Nahar, Sandy Kingdon",
    "time": "Friday, November 07, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "From Intern to Senior Engineer: Lessons That Actually Helped Me Grow",
    "description": "This session shares the real, lived experience of growing from an overwhelmed intern to a confident senior engineer, while navigating the pressures of being a woman and immigrant in tech. Designed for early to mid-career engineers, it explores the mindset shifts and strategies that helped the speaker overcome self-doubt, burnout, and invisible career roadblocks. From asking better questions to advocating for promotion and setting boundaries, attendees will hear pivotal moments that shaped real growth. Through honest stories and actionable advice, the talk highlights how success isn't linear—and offers practical tools and reflection prompts for anyone navigating their own path in tech.",
    "speaker_name(s)": "Kritika Vaid, Vertika Vaid",
    "time": "Friday, November 07, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "From Lost to Leveled Up: Cracking Big Codebases with Confidence",
    "description": "Feeling overwhelmed by a massive codebase? You're not alone. Whether you're joining your first team or switching projects, understanding a large, complex system as a software engineer can feel like a black box. In this session, we'll share a practical, step-by-step approach to navigating unfamiliar code with confidence, drawn from our experiences at Uber. You'll learn how to start with the product vision, map directories to functionality, identify key elements, and use modern AI-based tools like Cursor to speed up exploration and understanding. Mastering the skill of diving into a new codebase will accelerate your career growth by reducing ramp-up time, improving autonomy, and helping you make meaningful impact faster. If you've ever opened a repo and thought, \"Where do I even start?\", then this session is for you. Don't worry, we've all been there. You don't need to understand the whole codebase, just enough to make it yours.",
    "speaker_name(s)": "Isidora Vizcaya, Angela Tseng",
    "time": "Friday, November 07, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "beginner"
  },
  {
    "session_name": "From Reactive to Proactive: Building a Security Flywheel for Modern Organizations",
    "description": "",
    "speaker_name(s)": "Yaqi Lin, Gowri Patel",
    "time": "Friday, November 07, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Like Father, Like Daughter: From Floppy Disks to Cloud Tricks'f350 Years of Tech Tales and Girl Power",
    "description": "This is the multi-generation tale of a father and daughter who share their learnings of over 50 collective years in the technology industry. Jos'e9 Frietze recently retired from a 40-year career, which started as a Product Service Engineer at Hewlett Packard and retired as a Solutions Engineer at Keysight Technologies. With no intention of following in her dad's footsteps into what she understood as a child to be \"working with computers\", Sara landed a role as a finance manager for a product at Microsoft called Azure. Fast forward to today, this father and daughter realized they share very similar experiences, frustrations and learnings through their career journeys in the tech industry. Learn from over 50 years of experience how to succeed as a minority and as a woman in tech while uplifting those around you.",
    "speaker_name(s)": "Jos'e9 Frietze, Sara Fratianne",
    "time": "Friday, November 07, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "Securing On-premises, Cloud and Edge Infrastructure leveraging AI",
    "description": "Artificial Intelligence (AI) has become a cornerstone of modern cybersecurity, revolutionizing how organizations secure core infrastructure across on-premises, cloud, and edge environments. This presentation aims to discuss challenges in each of these areas, along with AI-driven security strategies and specific AI technologies available to address them. We will review several use cases to provide insight into best practices in industries. Additionally, we will examine the security measures needed to protect AI-generated content and systems from malicious attacks, as well as the necessity of safeguarding the AI technologies themselves from such threats.",
    "speaker_name(s)": "Dona Mukherjee",
    "time": "Friday, November 07, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Technology",
    "experience_level": "intermediate"
  },
  {
    "session_name": "Small Actions, Big Impact: The Power of Purpose-Driven Tech",
    "description": "Small actions can drive big change. Hear from Savannah, Senior Impact Partnerships Manager, as she explains how technology is transforming the way brands and consumers give back. Discover how integrating purpose-driven solutions are revolutionizing financial technology, seamlessly embedding donations into payments and empowering millions to support causes with a single click. Join us to learn how technology can turn everyday transactions into lasting change.",
    "speaker_name(s)": "Savannah Lennertz",
    "time": "Friday, November 07, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "The Complete Package: Traversing multi-decade career as a woman leader",
    "description": "",
    "speaker_name(s)": "Shriya Malhotra, Deepa Nair",
    "time": "Friday, November 07, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Career",
    "experience_level": ""
  },
  {
    "session_name": "The Unbusy Path: Reclaiming Time, Energy, and Purpose in Tech",
    "description": "",
    "speaker_name(s)": "Sravanthi Naraharisetti, Mush (Mushfiq) Khan",
    "time": "Friday, November 07, 02:15 PM 03:00 PM",
    "type": "Presentation",
    "category": "Culture",
    "experience_level": ""
  },
  {
    "session_name": "Excelling in Product Management in the Era of Agents",
    "description": "In the rapidly evolving landscape of product management, the integration of Agents and AI-driven tools is transforming how products are conceived, developed, and delivered. This panel will explore the best tools and practices that product managers can leverage to stay relevant and excel in their roles. We will delve into the importance of building user-centric products, focusing on user empathy, and solving real user problems. Join us for an insightful discussion with industry experts who will share their experiences, strategies, and actionable insights to help you navigate the complexities of modern product management. While some panelists may advocate for the extensive use of AI tools to streamline processes and enhance decision-making, others might emphasize the need for a balanced approach that combines technology with human intuition.",
    "speaker_name(s)": "",
    "time": "",
    "type": "Panel",
    "category": "Technology",
    "experience_level": "advanced"
  }
]